[
  {
    "title": "Launchify",
    "url": "https://www.launchify.club?utm_source=boilercodeapp",
    "text": "Ship 🚀 your Startup in Days, not Weeks. Prebuilt UI components, ready-to-use NextJS boilerplate codes & AI integration to make your app Production ready",
    "category": "premium",
    "hide": "FALSE",
    "page": "launchify",
    "fullDescription": "Launchify is a Next.js boilerplate with a landing page builder and multiple integrations. Easily create landing pages with a drag-and-drop builder and AI copywriting support. Connect to any database with Drizzle ORM, and set up payment gateways, authentication, and analytics. Integrate customer support, blogs, and more. Get started today and launch your business quickly and efficiently. Try Launchify now!"
  },
  {
    "title": "Shipfast",
    "url": "https://shipfa.st/?via=kwiktwik",
    "text": "#2 product of the day on PH (945 upvotes) . By @marc_louvion. Starts at $179. Considered to be the best by many.",
    "category": "premium",
    "hide": "FALSE",
    "page": "shipfast",
    "fullDescription": "\"Shipfast is a powerful and intuitive tool that has swiftly climbed the ranks to become the #2 product of the day on Product Hunt, amassing an impressive 945 upvotes. Developed by the esteemed @marc_louvion, Shipfast offers a seamless solution for individuals and businesses alike, starting at an accessible price point of $179.With its comprehensive features and robust functionality, Shipfast empowers users to navigate the complexities of shipping logistics effortlessly. From tracking shipments in real-time to optimizing delivery routes, this versatile tool equips you with the tools necessary to ensure smooth sailing for your business operations."
  },

  {
    "title": "Divjoy",
    "url": "https://divjoy.com/?via=kwiktwik",
    "text": "Divjoy is a SaaS boilerplate built with Next.js; designed to help software developers quickly launch their projects.",
    "category": "premium",
    "hide": "FALSE",
    "page": "divjoy",
    "fullDescription": "Divjoy is an innovative SaaS (Software as a Service) solution tailored for software developers seeking efficient project launches. Engineered with Next.js, a popular React framework, Divjoy streamlines the development process by providing a comprehensive boilerplate.Whether embarking on a new venture or seeking to enhance existing projects, Divjoy equips developers with the essential resources to expedite development cycles and focus on crafting exceptional user experiences. Its intuitive interface and robust feature set make it a valuable asset for teams and individuals alike, aiming to maximize productivity and accelerate time-to-market."
  },
  {
    "title": "Nextbase",
    "url": "https://usenextbase.com",
    "text": "Nextbase is a SaaS boilerplate built on Next.js that simplifies building and launching SaaS applications.",
    "category": "premium",
    "hide": "FALSE",
    "page": "nextbase",
    "fullDescription": "Nextbase is a powerful tool designed to streamline the process of developing and launching SaaS (Software as a Service) applications. Built on the robust Next.js framework, Nextbase offers developers a comprehensive boilerplate solution that accelerates the development lifecycle. With Nextbase, developers can leverage the cutting-edge features of Next.js, a popular React framework, to rapidly create scalable and performant SaaS applications.Overall, Nextbase empowers developers to build and launch innovative SaaS applications with speed, scalability, and security, making it an indispensable tool for modern software development teams."
  },
  {
    "title": "Codeassi",
    "url": "https://codeassi.st/?via=kwiktwik",
    "text": "Heyâ want to build your website super fastð",
    "category": "premium",
    "hide": "FALSE",
    "page": "codeassi",
    "fullDescription": "\"Introducing Codeassi â your ultimate companion for rapid website development! With Codeassi, constructing your dream website becomes a breeze, delivering speed and efficiency like never before. Whether you're a seasoned developer or just starting out, our suite of tools empowers you to craft stunning websites in record time.Codeassi provides a seamless environment where creativity thrives and productivity soars.With Codeassi, building a website is not just a task â it's an exhilarating journey of creativity and innovation.Join the ranks of satisfied developers who have unlocked the true potential of web development. Get started with Codeassi today and watch your ideas take flight! ð"
  },

  {
    "title": "Gravity",
    "url": "https://usegravity.app/?ref=marsxdev",
    "text": "Spin up a new SaaS product in 5 minutes with the leading Node.js SaaS boilerplate. Contains all features you need in a single installâ even AI.",
    "category": "premium",
    "hide": "FALSE",
    "page": "gravity",
    "fullDescription": "Introducing Gravity, the ultimate toolkit for launching your next SaaS (Software as a Service) venture with unparalleled speed and efficiency. Designed with Node.js at its core, Gravity is a cutting-edge boilerplate that empowers entrepreneurs and developers to spin up a fully functional SaaS product in just five minutes.With Gravity, you can focus on refining your product concept and reaching your target market, knowing that the technical groundwork has been expertly laid out for you. Say goodbye to lengthy development cycles and hello to rapid innovation with Gravityâthe leading Node.js SaaS boilerplate that accelerates your journey from idea to execution."
  },
  {
    "title": "NextJS Boilerplate",
    "url": "https://github.com/ixartz/Next-js-Boilerplate",
    "text": "5300 GitHub stars and 1000 forks. By @ixartz",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-boilerplate",
    "fullDescription": "NextJS Boilerplate, curated and maintained by the renowned developer @ixartz, is a robust foundation for building powerful web applications with Next.js. Garnering substantial recognition from the development community with 5300 stars and 1000 forks on GitHub, this boilerplate offers an efficient starting point for developers seeking to expedite their project setup.NextJS Boilerplate stands as a dependable companion, accelerating your journey towards crafting exceptional web experiences with Next.js.Its comprehensive documentation provides clear guidance and insights into its usage, allowing developers to quickly grasp its capabilities and harness its full potential."
  },
  {
    "title": "Shipixen",
    "url": "https://shipixen.com/",
    "text": "#1 product of the day (847 upvotes) on PH. By @d4m1n. Starts at $86",
    "category": "premium",
    "hide": "FALSE",
    "page": "shipixen",
    "fullDescription": "Shipixen is a cutting-edge tool that has secured its position as the #1 product of the day on Product Hunt with an impressive 847 upvotes. Developed by the talented @d4m1n, Shipixen is revolutionizing the way businesses manage their shipping processes. With its user-friendly interface and robust features, Shipixen empowers users to streamline their shipping operations efficiently.Whether you're shipping domestically or internationally, Shipixen offers seamless integration with various carriers and provides real-time tracking capabilities, ensuring that your shipments reach their destination swiftly and securely. "
  },
  {
    "title": "Boilercode",
    "url": "https://www.boilercode.co/",
    "text": "#1 product of the day (636 upvotes) on PH. By @manoj_ahi. Starts at $79",
    "category": "premium",
    "hide": "FALSE",
    "page": "boilercode",
    "fullDescription": "Boilercode, hailed as the #1 product of the day on Product Hunt with an impressive 636 upvotes, is a revolutionary tool crafted by @manoj_ahi. Pioneering a seamless development experience, Boilercode empowers developers with an array of functionalities aimed at accelerating project initiation and streamlining workflow efficiency.From code scaffolding to dependency management, Boilercode simplifies the development process, enabling users to focus on innovation rather than infrastructure. Its versatility extends across various frameworks and programming languages, ensuring compatibility and flexibility for diverse project requirements."
  },
  {
    "title": "SAAS Starter",
    "url": "https://sandeep1995.gumroad.com/l/saas-starter-pro",
    "text": "1 review with 5 stars. By @sandeep_indie. Starts at $29",
    "category": "premium",
    "hide": "FALSE",
    "page": "saas-starter",
    "fullDescription": "SAAS Starter is a cutting-edge software as a service (SaaS) solution designed to kickstart your digital endeavors with unparalleled efficiency and ease. Crafted by the expertise of @sandeep_indie, this platform has garnered rave reviews, boasting a perfect 5-star rating from its satisfied users.Priced competitively starting at just $29, SAAS Starter offers unbeatable value for its robust features and seamless functionality. From intuitive project management tools to customizable templates and advanced analytics, every facet of your digital journey is meticulously catered to, ensuring optimal performance and unparalleled success."
  },
  {
    "title": "Shipped.club",
    "url": "https://shipped.club/",
    "text": "150 customers. starts at $147. By @ikoichi",
    "category": "premium",
    "hide": "FALSE",
    "page": "shipped",
    "fullDescription": "\"Introducing \"\"Shipped\"\" by @ikoichi â an innovative suite of tools designed to streamline your shipping processes right from the moment you launch your business. With no reviews yet, this brand-new solution promises to revolutionize your shipping experience from day one. At a starting price of $147, \"\"Shipped\"\" offers an affordable entry point for businesses of all sizes. Whether you're a budding entrepreneur or an established enterprise, these tools are crafted to meet your shipping needs with precision and efficiency. With its user-friendly interface and robust functionality, \"\"Shipped\"\" promises to be your trusted companion as you navigate the complexities of the shipping world.\""
  },
  {
    "title": "Nebula",
    "url": "https://getnebula.news/",
    "text": "Starts at $0. By @dlcastillop",
    "category": "free;premium",
    "hide": "FALSE",
    "page": "nebula",
    "fullDescription": "Nebula is a versatile suite of digital tools meticulously designed to empower creators across various domains. Crafted by the skilled hands of @dlcastillop, Nebula offers an array of functionalities tailored to streamline workflows and ignite innovation. From content creation to project management, Nebula seamlessly integrates into your creative process, providing a dynamic platform for exploration and expression.Join the ranks of inspired creators who have made Nebula their digital companion. Revolutionize your creative process, unleash your imagination, and bring your vision to life with Nebula â the ultimate toolkit for creators, by @dlcastillop."
  },
  {
    "title": "MongoDB",
    "url": "https://github.com/hoangvvo/nextjs-mongodb-app",
    "text": "A Next.js and MongoDB web application; designed with simplicity for learning and real-world applicability in mind.",
    "category": "free",
    "hide": "FALSE",
    "page": "mongodb",
    "fullDescription": "MongoDB is a powerful NoSQL database that provides flexibility and scalability for modern applications. In this context, it serves as the foundational data storage solution for a Next.js and MongoDB web application.This application is meticulously crafted with a focus on simplicity, making it an ideal platform for both learning purposes and real-world scenarios. Leveraging the strengths of MongoDB, it offers efficient data management capabilities, enabling seamless storage, retrieval, and manipulation of information.The integration of Next.js, a popular React framework, enhances the user experience with its dynamic and interactive frontend components."
  },
  {
    "title": "Next.js with TypeScript",
    "url": "https://github.com/vercel/next.js/tree/canary/examples/with-typescript",
    "text": "This is a really simple project that shows the usage of Next.js with TypeScript.",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-with-typescript",
    "fullDescription": "Next.js with TypeScript is an innovative tool that combines the power of Next.js, a popular React framework for building server-side rendered (SSR) and static web applications, with the robustness and type safety of TypeScript, a statically typed superset of JavaScript. This tool provides developers with a seamless environment to create highly scalable and maintainable web applications with ease.This tool is ideal for developers who want to leverage the benefits of Next.js while ensuring type safety and improved development experience with TypeScript.Next.js with TypeScript empowers developers to build modern web applications with confidence"
  },
  {
    "title": "Emotion",
    "url": "https://github.com/zeit/next.js/tree/canary/examples/with-emotion",
    "text": "Extract and inline critical css with @emotion/css; @emotion/server; @emotion/react; and @emotion/styled.",
    "category": "free",
    "hide": "FALSE",
    "page": "emotion",
    "fullDescription": "Emotion is a comprehensive toolkit designed to streamline the management of CSS styles within React applications. Leveraging the power of @emotion/css, @emotion/server, @emotion/react, and @emotion/styled, this toolset offers developers an efficient solution for handling CSS, particularly critical CSS, in their projects.Furthermore, Emotion empowers developers to harness the full potential of React by providing specialized packages such as @emotion/react and @emotion/styled. These packages enable the creation of styled components and dynamic styles with ease, enhancing code readability and maintainability."
  },
  {
    "title": "Apollo",
    "url": "https://github.com/zeit/next.js/tree/canary/examples/with-apollo",
    "text": "integrate Apollo seamlessly with Next.js data fetching methods to fetch queries in the server and hydrate them in the browser.",
    "category": "free",
    "hide": "FALSE",
    "page": "apollo",
    "fullDescription": "The integration of Apollo with Next.js provides a powerful solution for seamlessly managing data fetching and state management in server-rendered React applications. By combining Apollo Client, a comprehensive GraphQL client, with Next.js, a popular React framework for server-side rendering, you can efficiently fetch queries on the server side and then hydrate them in the browser. This integration streamlines the process of managing data flow, allowing for smoother user experiences and improved performance.The integration of Apollo with Next.js offers a powerful solution for managing data fetching and state management in server-rendered React applications."
  },
  {
    "title": "Redux",
    "url": "https://github.com/zeit/next.js/tree/canary/examples/with-redux",
    "text": "Redux Toolkit TypeScript Example",
    "category": "free",
    "hide": "FALSE",
    "page": "redux",
    "fullDescription": "Redux is a powerful state management library for JavaScript applications, commonly used with libraries/frameworks like React. It provides a predictable state container for managing the application's state and helps to make state mutations predictable by imposing certain restrictions on how and when updates can occur. Redux operates on a unidirectional data flow principle, where the state of the application is stored in a single immutable state tree, and changes are made by dispatching actions, which are plain JavaScript objects describing the change. These actions are then handled by pure functions called reducers, which specify how the state should change in response to the actions."
  },
  {
    "title": "Blazity",
    "url": "https://github.com/Blazity/next-enterprise",
    "text": "Enterprise-grade Next.js boilerplate built with Tailwind CSS; Radix UI; TypeScript; ESLint; Prettier; Jest; Playwright; Storybook; etc.",
    "category": "free",
    "hide": "FALSE",
    "page": "blazity",
    "fullDescription": "Blazity is a powerful tool designed for developers seeking to streamline their Next.js projects with enterprise-grade efficiency. Crafted with meticulous attention to detail, Blazity serves as a robust boilerplate, integrating cutting-edge technologies to enhance productivity and facilitate seamless development workflows.AMaintaining code consistency and adhering to best practices is effortless with Blazity's integration of ESLint and Prettier. These tools work harmoniously to enforce coding standards, detect errors, and automatically format code, fostering clean and readable codebases.Testing is a breeze with Blazity, thanks to its incorporation of Jest and Playwright."
  },
  {
    "title": "Nextlessjs",
    "url": "https://nextlessjs.com/",
    "text": "Next.js + Serverless. For scalable and production-ready SaaS products. It includes Authentication; Payment; Teams; Dashboard; Landing Page; Emails. Starts at $699",
    "category": "premium",
    "hide": "FALSE",
    "page": "nextlessjs",
    "fullDescription": "Nextless.js is a powerful amalgamation of Next.js and Serverless technologies, meticulously crafted to cater to the needs of developers aiming to build scalable and production-ready Software as a Service (SaaS) products. With a comprehensive suite of features, Nextless.js simplifies the development process, enabling you to focus on innovation rather than infrastructure.Experience the synergy of Next.js and Serverless with Nextless.js, and unlock the full potential of your SaaS product development journey. Dive in today and revolutionize the way you build scalable and robust applications."
  },
  {
    "title": "Create Next App",
    "url": "https://create-next-app.dev/",
    "text": "An official Next.js CLI tool for creating Next.js apps.",
    "category": "free",
    "hide": "FALSE",
    "page": "create-next-app",
    "fullDescription": "\"Create Next App is the official command-line interface (CLI) tool provided by Next.js, tailored specifically for effortlessly creating Next.js applications. Leveraging this tool simplifies the process of initializing and setting up a new Next.js project, streamlining the development workflow.With \"\"Create Next App,\"\" developers can quickly generate the foundational structure of a Next.js application, eliminating the need for manual setup and configuration. This tool automates the creation of essential files and directories, ensuring a standardized and efficient starting point for building Next.js projects.\""
  },
  {
    "title": "Next.js with CSS Modules",
    "url": "https://github.com/vercel/next.js/tree/master/examples/with-css-modules",
    "text": "A Next.js example that demonstrates how to use CSS Modules.",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-with-css-modules",
    "fullDescription": "Next.js with CSS Modules is a powerful combination for building dynamic and responsive web applications with ease. Next.js, a popular React framework, provides a robust environment for server-side rendering, routing, and efficient developer workflows. When paired with CSS Modules, developers gain granular control over styling by encapsulating styles within components, preventing global namespace clashes and ensuring modularity.This example showcases the seamless integration of Next.js with CSS Modules, highlighting best practices for managing styles in a modular and scalable manner.Overall, this Next.js example with CSS Modules demonstrates how to harness the power of modular styling"
  },
  {
    "title": "Next.js with Sass",
    "url": "https://github.com/vercel/next.js/tree/master/examples/with-sass",
    "text": "A Next.js example that demonstrates how to use Sass.",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-with-sass",
    "fullDescription": "Next.js with Sass is a powerful combination that empowers developers to create dynamic and visually stunning web applications with ease. This toolkit seamlessly integrates Next.js,a popular React framework for building server-side rendered applications, with Sass,a robust CSS preprocessor that simplifies styling workflows.This example demonstrates how to harness the capabilities of Sass within a Next.js project, enabling developers to organize styles efficiently, reuse code snippets, and create visually appealing user interfaces.Whether you're a seasoned developer or just getting started,Next.js with Sass provides a flexible and efficient solution for building modern web applications."
  },
  {
    "title": "Next.js with Styled JSX",
    "url": "https://github.com/vercel/next.js/tree/master/examples/with-styled-jsx",
    "text": "A Next.js example that demonstrates how to use Styled JSX.",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-with-styled-jsx",
    "fullDescription": "Next.js with Styled JSX is a powerful combination for building dynamic and aesthetically pleasing web applications.Next.js provides a robust framework for server-side rendering, routing, and efficient React application development.Styled JSX, on the other hand, is Next.js's built-in styling solution that allows developers to write encapsulated CSS directly within their components.Next.js offers hot reloading capabilities, enabling developers to see changes in real-time without manually refreshing the browser.Styled JSX allows developers to write CSS directly within JavaScript components, promoting a cohesive development experience."
  },
  {
    "title": "Next.js with CSS-in-JS",
    "url": "https://github.com/vercel/next.js/tree/master/examples/with-css-in-js",
    "text": "A Next.js example that demonstrates how to use CSS-in-JS.",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-with-cssinjs",
    "fullDescription": "This Next.js example showcases the seamless integration of CSS-in-JS within the Next.js framework, offering a powerful and flexible approach to styling web applications. By leveraging the capabilities of Next.js alongside the expressive nature of CSS-in-JS, developers can effortlessly create dynamic, responsive, and visually appealing user interfaces.In summary, this Next.js example with CSS-in-JS encapsulates the synergy between a powerful web development framework and a modern approach to styling. In summary, this Next.js example with CSS-in-JS encapsulates the synergy between a powerful web development framework and a modern approach to styling"
  },
  {
    "title": "Next.js with Server-Side Rendering",
    "url": "https://github.com/vercel/next.js/tree/master/examples/with-server-side-rendering",
    "text": "A Next.js example that demonstrates how to use Server-Side Rendering.",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-with-serverside-rendering",
    "fullDescription": "Explore the power of Server-Side Rendering (SSR) with Next.js through this comprehensive example. Next.js, a React framework, empowers developers to build high-performance web applications effortlessly. With SSR, the content is generated on the server and delivered to the client, enhancing performance, SEO, and user experience.In this example, you'll delve into the intricacies of SSR within Next.js, understanding its benefits and implementation nuances. Witness how Next.js seamlessly integrates SSR, allowing you to render React components on the server, resulting in faster page loads and enhanced SEO capabilities."
  },
  {
    "title": "Next.js with Static Site Generation",
    "url": "https://github.com/vercel/next.js/tree/master/examples/with-static-site-generation",
    "text": "A Next.js example that demonstrates how to use Static Site Generation.",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-with-static-site-generation",
    "fullDescription": "Explore the power of Static Site Generation(SSG)with Next.js through this comprehensive example.Next.js is a versatile React framework renowned for its flexibility and efficiency in building web applications. With the advent of Static Site Generation,Next.js takes a significant leap forward in performance and scalability.By immersing yourself in this Next.js with Static Site Generation example, you'll acquire the knowledge and skills necessary to build blazing-fast, scalable websites optimized for the modern web landscapeWhether you're a seasoned developer or just starting with Next.js, this example provides valuable insights and practical guidance on harnessing the full potential of SSG."
  },
  {
    "title": "Next.js with API Routes",
    "url": "https://github.com/vercel/next.js/tree/master/examples/with-api-routes",
    "text": "A Next.js example that demonstrates how to use API Routes.",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-with-api-routes",
    "fullDescription": "Next.js with API Routes is an illustrative example showcasing the seamless integration of API Routes within a Next.js application. Next.js, a React-based framework, empowers developers to build modern web applications with server-side rendering and efficient client-side navigation. This example emphasizes the utilization of API Routes, a feature within Next.js that allows developers to create powerful backend logic directly within their frontend application.Additionally, they can gain insights into best practices for data fetching, handling authentication, and implementing middleware to enhance API security and functionality."
  },
  {
    "title": "Next.js with Custom Server",
    "url": "https://github.com/vercel/next.js/tree/master/examples/with-custom-server",
    "text": "A Next.js example that demonstrates how to use a custom server.",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-with-custom-server",
    "fullDescription": "Next.js with Custom Server is a comprehensive example showcasing the utilization of a custom server within the Next.js framework. Next.js, renowned for its efficiency in building server-rendered React applications, offers immense flexibility through its custom server feature. This example serves as a guide, illustrating how to harness this capability effectively.This example serves as an invaluable resource for developers seeking to deepen their understanding of Next.js and explore its advanced features. With clear documentation and well-commented code, it provides a step-by-step walkthrough, elucidating the process of setting up and leveraging a custom server within a Next.js project."
  },
  {
    "title": "Next.js with Deployment",
    "url": "https://github.com/vercel/next.js/tree/master/examples/with-deployment",
    "text": "A Next.js example that demonstrates how to deploy a Next.js app.",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-with-deployment",
    "fullDescription": "The Next.js Deployment Tool is an exemplary implementation showcasing the seamless deployment process for Next.js applications.Next.js, a popular React framework, offers a robust environment for building fast, scalable web applications.This tool provides a comprehensive demonstration of deploying Next.js apps, ensuring a smooth transition from development to production.Overall, the Next.js Deployment Tool serves as an invaluable resource for developers looking to deploy their Next.js applications efficiently and securely.Whether deploying a simple portfolio site or a complex web application, this tool provides the guidance and tools necessary to ensure a successful deployment process."
  },
  {
    "title": "RAN Boilerplate",
    "url": "https://github.com/sly777/ran",
    "text": "â¡ RAN! React . GraphQL . Next.js Toolkit â¡ - SEO-Ready; Production-Ready; SSR; Hot-Reload; CSS-in-JS; Caching; CLI commands",
    "category": "free",
    "hide": "FALSE",
    "page": "ran-boilerplate",
    "fullDescription": "Introducing RAN Boilerplate, the ultimate toolkit designed for developers harnessing the power of modern web development technologies.With RAN, you'll have everything you need to kickstart your projects, combining the robustness of React,the flexibility of GraphQL,and the efficiency of Next.js.With RAN Boilerplate, you have the foundation to build cutting-edge web applications that are robust, performant, and user-friendly.Whether you're a seasoned developer or just starting out,RAN empowers you to create exceptional experiences on the web.Streamline your workflow with a set of intuitive command-line interface(CLI)commands,enabling quick setup configuration,and deployment of your projects."
  },
  {
    "title": "Next.js with Stripe",
    "url": "https://github.com/vercel/nextjs-subscription-payments",
    "text": "A starter for using Stripe with Next.js",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-with-stripe",
    "fullDescription": "Next.js with Stripe is a comprehensive toolkit designed to seamlessly integrate the powerful capabilities of Stripe payment processing with the flexibility and efficiency of Next.js, a popular React framework for building server-side rendered and statically generated web applications. This starter kit provides developers with a streamlined solution for incorporating Stripe's robust payment infrastructure into their Next.js projects, enabling secure and efficient online transactions.With Next.js with Stripe, developers gain access to a range of essential tools and features tailored to simplify the integration process."
  },
  {
    "title": "ReScript",
    "url": "https://github.com/ryyppy/rescript-nextjs-template",
    "text": "Opinionated Boilerplate for NextJS; Tailwind and ReScript",
    "category": "free",
    "hide": "FALSE",
    "page": "rescript",
    "fullDescription": "\"ReScript is a powerful programming language that blends functional and imperative programming paradigms, designed for building robust and efficient web applications. When paired with Next.js, a popular React framework for building server-side rendered and static websites, and Tailwind CSS, a utility-first CSS framework, it forms a potent combination for creating modern web experiences.Whether you're starting a new project or looking to modernize an existing one, the \"\"Opinionated Boilerplate for NextJS; Tailwind and ReScript\"\" tool empowers developers to build high-quality web applications with confidence and efficiency.\""
  },
  {
    "title": "React Next",
    "url": "https://github.com/react-next-boilerplate/react-next-boilerplate",
    "text": "A basis for reducing the configuration of your projects with nextJS; best development practices and popular libraries",
    "category": "free",
    "hide": "FALSE",
    "page": "react-next",
    "fullDescription": "React Next is a comprehensive toolkit designed to streamline the setup and configuration of your projects using Next.js. Next.js is a powerful framework for React that offers server-side rendering, automatic code splitting, and simplified routing, making it an ideal choice for building modern web applications.React Next, you can leverage the best development practices and integrate popular libraries seamlessly into your Next.js projects.Next.js projects,React Next is the ultimate toolkit to elevate your development experience. Start building better web applications today with React Next.Say goodbye to tedious configuration processes and hello to rapid development."
  },
  {
    "title": "Crystallize",
    "url": "https://github.com/CrystallizeAPI/crystallize-nextjs-boilerplate",
    "text": "Fully featured Next.js / React eCommerce boilerplate. Combine rich marketing content with product information to create highly converting online stores.  ",
    "category": "free",
    "hide": "FALSE",
    "page": "crystallize",
    "fullDescription": "Crystallize is a cutting-edge Next.js and React eCommerce boilerplate that empowers businesses to build fully-featured online stores with unparalleled versatility and efficiency.Designed to seamlessly integrate rich marketing content with comprehensive product information, Crystallize offers a dynamic platform for creating highly converting online retail experiences.Whether you're a small boutique or a large enterprise,Crystallize offers the flexibility, functionality, and scalability needed to create and manage successful online retail ventures. With its powerful features and intuitive interface,Crystallize is the ultimate solution for building next-generation eCommerce experiences."
  },
  {
    "title": "Hasura",
    "url": "https://github.com/ghoshnirmalya/nextjs-hasura-boilerplate",
    "text": "ð¨ Boilerplate for building applications using Hasura and Next.js",
    "category": "free",
    "hide": "FALSE",
    "page": "hasura",
    "fullDescription": "Hasura ð¨ is a meticulously crafted boilerplate designed to streamline the development process of applications using Hasura and Next.js. Hasura, renowned for its GraphQL engine, empowers developers with a robust backend infrastructure, while Next.js, a versatile React framework, facilitates seamless frontend development. This boilerplate integrates the power of both technologies, offering developers a cohesive and efficient solution for building modern applications.Hasura ð¨ empowers you to build sophisticated applications with ease, flexibility, and efficiency. Explore the limitless possibilities of modern web development with Hasura ð¨ and take your projects to new heights."
  },
  {
    "title": "React; Firebase Firestore",
    "url": "https://github.com/suevalov/next-blog-firestore",
    "text": "Blog built with React; Next.js; Firebase Firestore; Styled-Component; Mobx State Tree",
    "category": "free",
    "hide": "FALSE",
    "page": "react-firebase-firestore",
    "fullDescription": "React is a popular JavaScript library for building user interfaces, known for its declarative and component-based approach. It allows developers to efficiently create interactive web applications by breaking down the UI into reusable components.Combining these tools, you can build powerful and scalable web applications with interactive UIs, real-time data synchronization, efficient rendering, and robust state management capabilities.Whether you're creating a blog, an e-commerce platform, or a collaborative web app, these tools provide the necessary building blocks to bring your ideas to life effectively."
  },
  {
    "title": "Electron â¡",
    "url": "https://github.com/saltyshiomix/nextron",
    "text": "3.2k stars",
    "category": "free",
    "hide": "FALSE",
    "page": "electron-",
    "fullDescription": "Electron â¡ï¸ is a powerful framework that enables developers to build cross-platform desktop applications using web technologies such as HTML, CSS, and JavaScript. With over 3.2k stars on GitHub, Electron has garnered significant attention and support from the developer community.Electron also provides a rich ecosystem of plugins and extensions, allowing developers to extend the framework's functionality and integrate with popular libraries and services. This extensibility empowers developers to customize their applications to suit specific requirements and deliver compelling user experiences."
  },
  {
    "title": "KNESTS Stack",
    "url": "https://github.com/tudorconstantin/knests/",
    "text": "Full-stack boilerplate (project/hackathon starter) with Docker/NodeJS/Typescript/GraphQL/React/Material-UI",
    "category": "free",
    "hide": "FALSE",
    "page": "knests-stack",
    "fullDescription": "The KNESTS Stack is a comprehensive boilerplate solution designed to kickstart your projects or hackathons with efficiency and ease. It encompasses a robust combination of cutting-edge technologies, seamlessly integrated to empower developers in building modern web applications. With a focus on scalability, maintainability, and rapid development, KNESTS Stack provides a solid foundation for crafting feature-rich applications.In summary, the KNESTS Stack empowers developers to unleash their creativity and build high-quality web applications efficiently.KNESTS Stack provides the tools and infrastructure needed to succeed in today's competitive development landscape."
  },
  {
    "title": "Devii",
    "url": "https://github.com/colinhacks/devii",
    "text": "A developer blog starter for (Next.js + React + TypeScript + Markdown + syntax highlighting)",
    "category": "free",
    "hide": "FALSE",
    "page": "devii",
    "fullDescription": "Devii is an innovative developer blog starter designed to empower developers in crafting professional and dynamic blogs with ease. Tailored specifically for the Next.js framework, Devii seamlessly integrates the power of React, TypeScript, Markdown, and syntax highlighting, providing developers with a robust toolkit to showcase their expertise, share insights, and connect with the developer community.Devii equips you with the tools you need to create compelling and impactful blog content effortlessly. Elevate your developer blog experience with Devii and make your mark in the digital landscape."
  },
  {
    "title": "Superplate",
    "url": "https://github.com/pankod/superplate",
    "text": "React Testing Library; styled-component; React Query; .env; Axios; Bundle Analyzer; Prettier and 30+ plugins.  2.7k stars",
    "category": "free",
    "hide": "FALSE",
    "page": "superplate",
    "fullDescription": "Superplate is a robust and versatile development tool designed to streamline React application development. With its extensive range of features and seamless integration of essential libraries, Superplate empowers developers to build sophisticated and efficient React projects with ease.With over 2.7k stars on GitHub, Superplate has garnered significant attention and acclaim from the developer community. Its comprehensive toolkit, coupled with an intuitive and user-friendly interface, has made it a preferred choice for React developers seeking to accelerate their development process and deliver high-quality applications efficiently."
  },
  {
    "title": "Next.js PWA Firebase",
    "url": "https://github.com/tomsoderlund/nextjs-pwa-firebase-boilerplate",
    "text": "Next.js serverless PWA with Firebase boilerplate. 204 stars",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-pwa-firebase",
    "fullDescription": "Next.js PWA Firebase is an advanced development tool tailored for building powerful Progressive Web Applications (PWAs) using Next.js and Firebase technologies. With a robust boilerplate structure, this tool streamlines the creation process, allowing developers to focus on crafting exceptional user experiences rather than grappling with complex setup procedures.Whether you're a seasoned developer or just starting your journey, the Next.js PWA Firebase boilerplate empowers you to leverage the latest web technologies to build cutting-edge PWAs that deliver unparalleled performance, reliability, and user engagement."
  },
  {
    "title": "Blogging template for Netlify",
    "url": "https://github.com/wutali/nextjs-netlify-blog-template",
    "text": "Next.js blogging template for Netlify",
    "category": "free",
    "hide": "FALSE",
    "page": "blogging-template-for-netlify",
    "fullDescription": "\"This meticulously crafted Blogging Template for Netlify is designed to empower bloggers with a seamless and efficient platform for sharing their thoughts and ideas with the world. Built with simplicity and versatility in mind, this template offers a user-friendly interface coupled with robust features to streamline the blogging experience.Seamlessly deploy your blog on Netlify with just a few clicks, ensuring hassle-free hosting and management.Whether you're a seasoned blogger or just starting out, this Blogging Template for Netlify provides the perfect foundation for building and growing your online presence with ease."
  },

  {
    "title": "Chakra",
    "url": "https://github.com/sozonome/nextarter-chakra",
    "text": "Battery packed template / boilerplate to initialize Next.js app with Chakra UI & Typescript setup â¨",
    "category": "free",
    "hide": "FALSE",
    "page": "chakra",
    "fullDescription": "Chakra is a meticulously crafted battery-packed template designed to streamline the initialization process of a Next.js application. This comprehensive boilerplate seamlessly integrates Chakra UI and Typescript, two powerhouse tools in modern web development, to empower developers with enhanced efficiency and flexibility.Chakra's template is adorned with â¨ enchanting features, including pre-configured settings, optimized project structure, and comprehensive documentation. Whether you're a seasoned developer or embarking on your coding journey, Chakra equips you with the tools you need to accelerate development and deliver exceptional web experiences."
  },
  {
    "title": "Tailwind Starter Blog",
    "url": "https://github.com/timlrx/tailwind-nextjs-starter-blog",
    "text": "Tailwind CSS blogging starter template.  6.1k stars",
    "category": "free",
    "hide": "FALSE",
    "page": "tailwind-starter-blog",
    "fullDescription": "The Tailwind Starter Blog is a meticulously crafted, responsive blogging template built on the foundation of Tailwind CSS â a highly popular utility-first CSS framework. With over 6.1k stars on GitHub, it has gained widespread acclaim for its simplicity, flexibility, and aesthetic appeal.Designed to streamline the process of creating a stylish and functional blog, this starter template provides developers with a robust set of tools and components. From beautifully designed layouts to customizable themes, it empowers users to effortlessly bring their blogging ideas to life.Featuring a clean and modern design, the Tailwind Starter Blog prioritizes readability and user experience"
  },
  {
    "title": "Prisma + tRPC",
    "url": "https://github.com/trpc/examples-next-prisma-starter",
    "text": "tRPC starter repo with E2E-testing",
    "category": "free",
    "hide": "FALSE",
    "page": "prisma-trpc",
    "fullDescription": "Prisma is an advanced ORM (Object-Relational Mapping) tool for Node.js and TypeScript that simplifies database access and management. It provides a type-safe and intuitive way to interact with databases, enabling developers to focus more on application logic rather than database queries.For those looking to kickstart their projects using Prisma and tRPC, the tRPC starter repo with E2E (End-to-End) testing provides a solid foundation. This starter repository includes all the necessary configurations and boilerplate code to quickly set up a project using Prisma and tRPC, along with integrated end-to-end testing capabilities."
  },
  {
    "title": "create-t3-app",
    "url": "https://github.com/t3-oss/create-t3-app",
    "text": "The best way to start a full-stack; typesafe Next.js app",
    "category": "free",
    "hide": "FALSE",
    "page": "createt3app",
    "fullDescription": "create-t3-app is an invaluable tool for developers looking to embark on the journey of building robust full-stack applications with ease. Tailored to provide a seamless experience, this tool facilitates the creation of a typesafe Next.js application, ensuring efficiency and reliability from the very beginning.With create-t3-app, developers can kickstart their projects effortlessly, sparing themselves the time-consuming setup processes and allowing them to dive straight into crafting their applications. Next.js, renowned for its performance, scalability, and intuitive development experience, create-t3-app empowers developers to build cutting-edge web applications with confidence."
  },
  {
    "title": "Precedent",
    "url": "https://github.com/steven-tey/precedent",
    "text": "An opinionated collection of components; hooks; and utilities for your Next.js project.",
    "category": "free",
    "hide": "FALSE",
    "page": "precedent",
    "fullDescription": "Precedent is a meticulously curated assortment of components, hooks, and utilities tailored to enhance the development experience of your Next.js projects.Crafted with a strong perspective,it offers a cohesive set of tools aimed at streamlining the development process and empowering developers to build robust,feature-rich applications with ease.Driven by a philosophy of opinionation,Precedent encourages best practices and architectural patterns, empowering developers to focus on building innovative features without getting bogged down by implementation details.Moreover,Precedent offers a diverse range of hooks and utilities engineered to address common development challenges efficiently."
  },
  {
    "title": "Shadcn/UI",
    "url": "https://github.com/shadcn-ui/ui",
    "text": "Beautifully designed components built with Radix UI and Tailwind CSS.",
    "category": "free",
    "hide": "FALSE",
    "page": "shadcnui",
    "fullDescription": "Elevate your web development projects with Shadcn/UI, a meticulously crafted collection of beautifully designed components. Shadcn/UI seamlessly blends the power of Radix UI and Tailwind CSS, offering you a robust toolkit to create stunning user interfaces effortlessly.With Shadcn/UI, you gain access to a diverse range of components, each meticulously designed to enhance both functionality and aesthetics. From sleek buttons to dynamic forms, every element is thoughtfully crafted to provide an exceptional user experience.Streamline your development process and create visually stunning interfaces that captivate users and elevate your projects to new heights."
  },
  {
    "title": "Nextacular",
    "url": "https://github.com/nextacular/nextacular",
    "text": "Built on top of popular and modern technologies such as Next JS; Tailwind; Prisma; and Stripe",
    "category": "free",
    "hide": "FALSE",
    "page": "nextacular",
    "fullDescription": "Nextacular is an innovative toolset meticulously crafted on the robust foundation of cutting-edge technologies, including Next JS, Tailwind, Prisma, and Stripe. Designed to empower developers and businesses alike,Nextacular seamlessly integrates these modern frameworks to streamline the creation of dynamic web applications with unparalleled efficiency and functionality.Harnessing the power of Next JS, Nextacular provides a solid infrastructure for building fast, scalable, and SEO-friendly web experiences.Leveraging Tailwind, it offers a sleek and customizable design system, allowing developers to effortlessly create stunning user interfaces that perfectly align with their brand aesthetics."
  },
  {
    "title": "Blitz",
    "url": "https://blitzjs.com/",
    "text": "Blitz picks up where Next.js leaves off; providing battle-tested libraries and conventions for shipping and scaling world wide applications.",
    "category": "free",
    "hide": "FALSE",
    "page": "blitz",
    "fullDescription": "Blitz is a powerful toolkit that seamlessly extends the capabilities of Next.js, a popular React framework.Designed to tackle the challenges of deploying and scaling applications globally, Blitz harnesses battle-tested libraries and industry-standard conventions.By building upon the foundation laid by Next.js,Blitz empowers developers to streamline the development process and deliver robust, high-performance applications.With Blitz, teams can confidently navigate the complexities of shipping and scaling worldwide applications, ensuring smooth user experiences and efficient resource utilization.Blitz equips you with the tools needed to conquer the demands of modern web development."
  },
  {
    "title": "Next.js + Tailwind CSS + TypeScript",
    "url": "https://github.com/theodorusclarence/ts-nextjs-tailwind-starter",
    "text": "ð Next.js + Tailwind CSS + TypeScript starter and boilerplate packed with useful development features",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-tailwind-css-typescript",
    "fullDescription": "Introducing the ultimate toolkit for modern web development: Next.js + Tailwind CSS + TypeScript. This dynamic trio combines cutting-edge technologies to empower developers with unparalleled efficiency and flexibility.This starter and boilerplate harnesses the full potential of Next.js, Tailwind CSS, and TypeScript, providing a solid foundation for your projects. Packed with useful development features, including hot module replacement, CSS purging, and TypeScript type checking, it empowers developers to hit the ground running and focus on building exceptional user experiences. Elevate your web development workflow and unlock endless possibilities with this powerhouse combination."
  },
  {
    "title": "Next Simple Starter",
    "url": "https://github.com/ooade/NextSimpleStarter",
    "text": "ð³ Simple and Accessible PWA boilerplate with Nextjs 12 and MUI",
    "category": "free",
    "hide": "FALSE",
    "page": "next-simple-starter",
    "fullDescription": "Introducing Next Simple Starter, the ultimate toolkit for swiftly launching Progressive Web Applications (PWAs) with unparalleled simplicity and accessibility. Crafted with the cutting-edge Next.js 12 framework and seamlessly integrated with Material-UI (MUI), this boilerplate empowers developers to create dynamic and responsive web applications effortlessly.Accessibility is at the forefront of Next Simple Starter's design philosophy. Leveraging Material-UI (MUI), a leading React UI framework, ensures that your application is not only visually stunning but also fully accessible to users of all abilities."
  },
  {
    "title": "Next Right Now",
    "url": "https://github.com/UnlyEd/next-right-now",
    "text": "Itâs a ready-to-use boilerplate based on the Next.js framework.",
    "category": "free",
    "hide": "FALSE",
    "page": "next-right-now",
    "fullDescription": "\"\"\"Next Right Now\"\" is a comprehensive and user-friendly tool designed to accelerate web development projects with its robust foundation built upon the Next.js framework. This ready-to-use boilerplate offers developers an efficient starting point for crafting modern and dynamic web applications.With \"\"Next Right Now,\"\" developers can leverage the power of Next.js, a popular React framework known for its server-side rendering capabilities, automatic code splitting, and seamless integration with React components. This boilerplate simplifies the setup process, allowing developers to focus on implementing features and functionalities rather than configuring the project environment from scratch.\""
  },
  {
    "title": "Next.js Redux Starter",
    "url": "https://github.com/CodementorIO/nextjs-redux-starter",
    "text": "Next.js + Redux + styled-components + Express = ð",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-redux-starter",
    "fullDescription": "The Next.js Redux Starter is a robust and efficient toolkit designed for developers seeking seamless integration of Next.js, Redux, styled-components, and Express in their web applications. Next.js, a powerful React framework, serves as the foundation, offering server-side rendering and routing capabilities, optimizing performance and SEO.Additionally, Express provides a robust backend framework, enabling you to build custom server logic seamlessly integrated with your Next.js frontend. This combination offers the versatility to handle API requests, authentication, and other server-side functionalities with ease."
  },
  {
    "title": "Solid",
    "url": "https://github.com/NextJSTemplates/solid-nextjs",
    "text": "Solid is a free Next.js template specifically crafted for startups / SaaS and software websites.",
    "category": "free",
    "hide": "FALSE",
    "page": "solid",
    "fullDescription": "Solid is an innovative Next.js template designed to empower startups, SaaS (Software as a Service), and software companies in building professional and engaging websites. Offering a seamless blend of aesthetics and functionality, Solid provides a robust foundation for showcasing products, services, and brand identity with sophistication.Solid's versatility is one of its standout features, enabling customization to suit specific business needs and preferences. Whether it's modifying layouts, integrating branding elements, or adding new features, Solid offers flexibility without compromising on performance."
  },
  {
    "title": "Makerkit",
    "url": "https://makerkit.dev/",
    "text": "Makerkit is a SaaS boilerplate built on top of Next.js; designed for software developers.",
    "category": "premium",
    "hide": "FALSE",
    "page": "makerkit",
    "fullDescription": "Makerkit is a versatile Software as a Service (SaaS) boilerplate meticulously crafted on the robust foundation of Next.js, tailored specifically for the discerning needs of software developers. With Makerkit, developers can seamlessly embark on their projects with confidence, leveraging its comprehensive toolkit and cutting-edge features.Designed with efficiency in mind, Makerkit boasts a rich assortment of pre-configured components and modules, reducing development overhead and time-to-market. From authentication systems to database integrations, Makerkit equips developers with the essential building blocks necessary to construct robust and scalable SaaS applications."
  },
  {
    "title": "Ship SaaS",
    "url": "https://shipsaas.com/",
    "text": "Build your SaaS in a weekend with a Next.js SaaS boilerplate",
    "category": "premium",
    "hide": "FALSE",
    "page": "ship-saas",
    "fullDescription": "\"\"\"Ship SaaS\"\" is a cutting-edge toolkit designed to streamline the process of building Software as a Service (SaaS) applications. Whether you're a seasoned developer or just starting out, Ship SaaS empowers you to transform your idea into a fully functional SaaS platform in just a weekend.With Ship SaaS, you harness the power of Next.js, a popular React framework, and its SaaS boilerplate. This means you can leverage the latest in web development technology without the hassle of starting from scratch. Next.js provides a robust foundation for building fast, scalable, and SEO-friendly web applications, ensuring that your SaaS product is optimized for success from day one.\""
  },
  {
    "title": "Supastarter",
    "url": "https://supastarter.dev/",
    "text": "Supastarter is a SaaS boilerplate built on Next.js providing a pre-built foundation for developing SaaS applications.",
    "category": "free",
    "hide": "FALSE",
    "page": "supastarter",
    "fullDescription": "Supastarter offers a comprehensive solution for kickstarting SaaS (Software as a Service) application development, leveraging the power of Next.js. Designed with efficiency and scalability in mind, Supastarter provides developers with a pre-built foundation, enabling them to focus on crafting innovative features and functionalities rather than starting from scratch.Supastarter serves as a versatile and powerful tool for developers embarking on SaaS application development journeys. Supastarter accelerates the development process and empowers businesses to deliver cutting-edge SaaS solutions to their customers with confidence."
  },
  {
    "title": "Supanextail",
    "url": "https://www.supanextail.dev/",
    "text": "Next.js based SaaS boilerplate that provides entrepreneurs and software developers with a scalable and customizable solution for rapidly launching their SaaS projects",
    "category": "free",
    "hide": "FALSE",
    "page": "supanextail",
    "fullDescription": "Supanextail is an innovative Next.js based SaaS boilerplate designed to empower entrepreneurs and software developers in swiftly launching their SaaS (Software as a Service) projects. Built upon the robust foundation of Next.js, Supanextail offers a scalable and highly customizable solution, ensuring seamless development and deployment processes.In summary,Supanextail stands as a cutting-edge solution for entrepreneurs and software developers embarking on the journey of SaaS development.With its blend of scalability, customizability, and rapid deployment capabilities,Supanextail empowers users to transform their innovative ideas into thriving SaaS ventures with confidence and efficiency."
  },
  {
    "title": "SaasPlanet",
    "url": "https://www.saasplanet.org/",
    "text": "Powerful SaaS boilerplate built on Next.js. It comes with everything you need to launch your SaaS application including authentication / billing and subscription management.",
    "category": "premium",
    "hide": "FALSE",
    "page": "saasplanet",
    "fullDescription": "SaasPlanet is a robust SaaS (Software as a Service) boilerplate meticulously crafted on the Next.js platform, designed to streamline the process of launching your very own SaaS application. With SaasPlanet, you'll find everything essential for a successful venture, from seamless authentication to efficient billing and comprehensive subscription management.This cutting-edge tool provides a solid foundation, sparing you the hassle of reinventing the wheel and allowing you to focus on what truly matters: developing and scaling your unique SaaS offering.SaasPlanet offers an intuitive and powerful solution to accelerate your journey towards success."
  },
  {
    "title": "Basejump",
    "url": "https://usebasejump.com/",
    "text": "Basejump is the ultimate SaaS boilerplate built on Next.js. Designed for entrepreneurs / startups / and software developers",
    "category": "free",
    "hide": "FALSE",
    "page": "basejump",
    "fullDescription": "Basejump is a cutting-edge SaaS boilerplate meticulously crafted on the powerful Next.js framework. Tailored specifically for entrepreneurs, startups, and software developers, Basejump is the quintessential toolkit for launching innovative software-as-a-service solutions with unparalleled efficiency and scalability.From seamless integration of essential features to customizable templates and robust architecture, Basejump provides a solid foundation for building dynamic, responsive, and feature-rich SaaS applications. It's time to elevate your software projects to new heights and leap ahead of the competition with Basejump."
  },
  {
    "title": "Modern MERN",
    "url": "https://modernmern.com/",
    "text": "Create your SaaS products with the famous MERN stack using the latest technologies: Next.js / TypeScript / Tailwind CSS / Prisma / Serverless.",
    "category": "premium",
    "hide": "FALSE",
    "page": "modern-mern",
    "fullDescription": "Embark on a journey of seamless SaaS product development with the Modern MERN stack, where innovation meets efficiency. Harness the latest technologies â Next.js, TypeScript, Tailwind CSS, Prisma, and Serverless â to elevate your development experience and create robust, scalable applications.Modern MERN Tools empower developers to create cutting-edge SaaS products that seamlessly blend performance, scalability, and a delightful user experience. Stay ahead of the curve and bring your ideas to life with the unparalleled synergy of Next.js, TypeScript, Tailwind CSS, Prisma, and Serverless. Your journey to innovation starts here."
  },
  {
    "title": "Bedrock",
    "url": "https://bedrock.mxstbr.com/",
    "text": "Bedrock is a Next.js based SaaS boilerplate designed for entrepreneurs / managing directors and software developers.",
    "category": "free",
    "hide": "FALSE",
    "page": "bedrock",
    "fullDescription": "Bedrock is a cutting-edge Next.js based SaaS boilerplate meticulously crafted to cater to the needs of entrepreneurs, managing directors, and software developers alike. With Bedrock, you embark on a journey of seamless digital innovation, empowering you to transform your visionary ideas into robust, scalable software solutions.In essence, Bedrock serves as a beacon of innovation, providing entrepreneurs, managing directors, and software developers with a robust platform to realize their visions and drive transformative change in the digital landscape.Bedrock empowers you to build the future with confidence and clarity."
  },
  {
    "title": "Next.js SaaS Boilerplate Generator",
    "url": "https://saasboilerplate.utekal.co.uk/",
    "text": "The Boilerplate Generator offers a Next.js-based SaaS boilerplate pre-equipped with elements such as user management / subscriptions and payment systems.",
    "category": "premium",
    "hide": "FALSE",
    "page": "nextjs-saas-boilerplate-generator",
    "fullDescription": "The Next.js SaaS Boilerplate Generator is a powerful tool designed to streamline the development process for Software as a Service(SaaS) applications.This innovative generator provides developers with a Next.js-based boilerplate that comes fully equipped with essential features for building robust SaaS platforms.Moreover, the boilerplate comes pre-integrated with subscription management capabilities, enabling developers to effortlessly implement subscription-based business models for their SaaS applications.Whether it's handling subscription plans,managing user subscriptions, or handling billing cycles, this boilerplate provides a solid foundation for building subscription-based services."
  },
  {
    "title": "SaaS UI",
    "url": "https://saas-ui.dev/",
    "text": "Saas UI is a React component library and starterkit that doesn't get in your way and helps you build intuitive SaaS products with speed.",
    "category": "premium",
    "hide": "FALSE",
    "page": "saas-ui",
    "fullDescription": "SaaS UI is a meticulously crafted React component library and starter kit designed to streamline the development process of intuitive Software as a Service (SaaS) products. With a focus on simplicity and efficiency, SaaS UI empowers developers to rapidly create sleek, user-friendly interfaces without unnecessary complexity.Featuring a comprehensive set of reusable React components, SaaS UI offers a cohesive design system that seamlessly integrates into your project workflow. Whether you're building a dashboard, analytics tool, or any other SaaS application, SaaS UI provides the building blocks you need to create a polished user experience."
  },
  {
    "title": "ZippyStarter",
    "url": "https://zippystarter.com/",
    "text": "Free up days of dev time; choose from a range of visually-stunning templates and ship landing pages / MDX blogs / portfolios / websites and more.",
    "category": "premium",
    "hide": "FALSE",
    "page": "zippystarter",
    "fullDescription": "Introducing ZippyStarter - the ultimate tool for streamlining your development process and unleashing your creativity with ease. With ZippyStarter, you can bid farewell to days of tedious coding and welcome a world of visually-stunning templates designed to elevate your projects effortlessly.ZippyStarter empowers you to focus on what truly matters - bringing your ideas to life. So why wait? Experience the freedom to create and innovate like never before with ZippyStarter. Try it today and revolutionize your development process.With just a few clicks, you can customize and personalize your chosen template to reflect your unique style and vision."
  },
  {
    "title": "Satria AI",
    "url": "https://satria.ai/templates",
    "text": "Helping organisations build AI-powered products",
    "category": "premium",
    "hide": "FALSE",
    "page": "satria-ai",
    "fullDescription": "Satria AI is a cutting-edge toolkit designed to assist organizations in constructing AI-powered products. With its comprehensive suite of resources and functionalities, Satria AI empowers businesses to harness the potential of artificial intelligence effectively. From streamlining development processes to optimizing performance, this innovative tool offers tailored solutions to meet the unique needs of each project. Whether it's data analysis, machine learning algorithms, or predictive modeling, Satria AI provides the essential framework for organizations to navigate the complexities of AI integration seamlessly."
  },
  {
    "title": "T3",
    "url": "https://create.t3.gg/",
    "text": "The best way to start a full-stack typesafe Next.js app",
    "category": "free",
    "hide": "FALSE",
    "page": "t3",
    "fullDescription": "T3 is a cutting-edge toolkit designed to streamline the creation process of full-stack, typesafe Next.js applications. Engineered with efficiency and precision in mind, T3 empowers developers to embark on their projects with confidence and ease.Furthermore, T3 provides an intuitive scaffolding system that expedites project setup and configuration. By automating repetitive tasks and boilerplate code generation, T3 enables developers to focus their energy on implementing core features and delivering exceptional user experiences.T3 empowers developers to unleash their creativity and bring their visions to life with unparalleled efficiency and precision."
  },
  {
    "title": "NextJs Dashboard",
    "url": "https://github.com/kitloong/nextjs-dashboard",
    "text": "A Next.JS boilerplate with the famous Open Source Boostrap Admin Template / CoreUI.",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-dashboard",
    "fullDescription": "The NextJs Dashboard is a cutting-edge tool designed to streamline the development process for web applications. Built upon the powerful Next.js framework, this dashboard provides developers with a robust boilerplate equipped with the renowned Open Source Bootstrap Admin Template/CoreUI.The NextJs Dashboard is a cutting-edge tool designed to streamline the development process for web applications. Built upon the powerful Next.js framework, this dashboard provides developers with a robust boilerplate equipped with the renowned Open Source Bootstrap Admin Template/CoreUI.NextJs Dashboard provides the tools and resources needed to bring your vision to life with ease and precision."
  },
  {
    "title": "Next Boilerplate",
    "url": "https://github.com/manjeshrv592/next-boilerplate",
    "text": "Next.JS / Shadcn/ui / Tailwind / ESLint and Prettier Boiler plate code with Dark mode Toggler.",
    "category": "free",
    "hide": "FALSE",
    "page": "next-boilerplate",
    "fullDescription": "Introducing Next Boilerplate, an advanced toolkit designed to streamline your web development process with Next.js, Shadcn/ui, Tailwind CSS,ESLint, and Prettier integration.This comprehensive boilerplate comes packed with essential features, including a Dark Mode Toggler,to enhance both functionality and aesthetics.Begin your web development journey efficiently with Next Boilerplate. Clone the repository, customize it to fit your project needs, and unleash the power of Next.js along with a suite of complementary tools and features. Whether you're building a personal website, a blog,or a full-fledged web application,Next Boilerplate provides the perfect foundation for your next project."
  },
  {
    "title": "Kirimase",
    "url": "https://github.com/nicoalbanese/kirimase",
    "text": "Command-line tool for building full-stack Next.js apps faster. It supercharges your development workflow; allowing you to quickly integrate packages and scaffold resources for your application",
    "category": "free",
    "hide": "FALSE",
    "page": "kirimase",
    "fullDescription": "Kirimase is a cutting-edge command-line tool meticulously designed to revolutionize the way developers build full-stack Next.js applications. With Kirimase, your development journey transcends traditional boundaries, accelerating your progress and unleashing the full potential of Next.js framework.In summary, Kirimase is your go-to companion for accelerating the development of full-stack Next.js applications. Whether you're a seasoned developer or just starting, this command-line tool empowers you to build innovative and feature-rich web applications faster than ever before.Execute commands with ease, making complex tasks more straightforward and accessible."
  },
  {
    "title": "Indiespace: SaaS Bundle",
    "url": "https://www.indiespace.store/",
    "text": "Indiespace offers a Next.js SaaS Bundle that includes landing & waitlist pages with an already setup SaaS boilerplate with every feature you need to get started. Starts at $39.",
    "category": "premium",
    "hide": "FALSE",
    "page": "indiespace-saas-bundle",
    "fullDescription": "Indiespace introduces a comprehensive solution with its SaaS Bundle, tailor-made for entrepreneurs and startups diving into the digital realm. Designed with the latest Next.js technology, this bundle boasts a dynamic combination of essential tools to kickstart your Software as a Service (SaaS) journey.Moreover, Indiespace eliminates the hassle of tedious setup processes by providing a pre-configured SaaS boilerplate. This feature-rich boilerplate comes equipped with everything you need to hit the ground running, sparing you the complexities of manual configuration and coding.Experience efficiency, innovation, and value like never before with Indiespace."
  },
  {
    "title": "Boilercode app",
    "url": "https://www.boilercode.app/",
    "text": "Build production-ready SaaS products effortlessly with preconfigured code. Starts at $35",
    "category": "premium",
    "hide": "FALSE",
    "page": "boilercode-app",
    "fullDescription": "Introducing Boilercode, your ultimate solution for swiftly crafting production-ready SaaS (Software as a Service) products with ease. Boilercode streamlines the development process by offering meticulously preconfigured code templates, enabling you to kickstart your projects promptly without the hassle of starting from scratch.With Boilercode, you gain access to a comprehensive toolkit designed to accelerate your development workflow. Whether you're a seasoned developer or just starting out, our intuitive interface and well-organized codebase empower you to create sophisticated SaaS applications effortlessly."
  },
  {
    "title": "Kami",
    "url": "https://kaminari.vercel.app/",
    "text": "Kami (short for Kaminari) is a modern Next.js Tailwind CSS and shadcn-ui boilerplate",
    "category": "free",
    "hide": "FALSE",
    "page": "kami",
    "fullDescription": "\"Kami, affectionately nicknamed \"\"Kaminari\"\" which means thunder in Japanese, represents a cutting-edge toolkit tailored for web development. This toolkit harnesses the combined power of Next.js, Tailwind CSS, and shadcn-ui, providing developers with a robust and efficient boilerplate to kickstart their projects.Additionally, Kami integrates shadcn-ui, a versatile UI framework, to further enhance the aesthetic appeal and functionality of web interfaces. shadcn-ui offers a plethora of components and utilities, enabling developers to effortlessly implement sleek and intuitive user interfaces. Kami equips you with the tools needed to bring your web projects to life with efficiency and style.\""
  },
  {
    "title": "Next starter",
    "url": "https://next-starter.bhanuteja.dev/",
    "text": "A starter project for next js with authentication - Contains React 17 + Typescript + Tailwind CSS etc",
    "category": "free",
    "hide": "FALSE",
    "page": "next-starter",
    "fullDescription": "\"Next Starter is a meticulously crafted starter project tailored specifically for kickstarting your Next.js applications with authentication features seamlessly integrated. Built with a robust stack including React 17, TypeScript, and Tailwind CSS, Next Starter empowers developers to jump-start their projects with modern technologies and best practices in mind.Kickstart your Next.js projects with confidence using Next Starter. Whether you're building a personal portfolio, an e-commerce platform, or a collaborative web application, Next Starter provides the essential tools and features you need to succeed. Dive into development and unlock endless possibilities with Next Starter."
  },

  {
    "title": "Next Express",
    "url": "https://github.com/MustansirZia/next-express-bootstrap-boilerplate",
    "text": "â¡ JavaScript boilerplate for a full stack app built using React.js / Next.js / Express.js / react-bootstrap / SCSS and full SSR with eslint.",
    "category": "free",
    "hide": "FALSE",
    "page": "next-express",
    "fullDescription": "Introducing Next Express, a lightning-fast JavaScript boilerplate designed to streamline the development process for full-stack applications. This comprehensive toolkit leverages the power of React.js, Next.js, and Express.js, combining them seamlessly to empower developers in crafting robust web applications with ease.dapt Next Express to suit your project requirements effortlessly, whether you're developing a small-scale prototype or a full-fledged enterprise application, leveraging the flexibility and extensibility of its components.In summary, Next Express empowers developers to accelerate their development workflow, delivering high-performance, feature-rich applications with ease."
  },
  {
    "title": "NextJS Redux-Wrapper Material-UI",
    "url": "https://github.com/joaopaulomoraes/nextjs-with-redux-and-material-ui",
    "text": "A boilerplate NextJS with Redux and Material UI",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-reduxwrapper-materialui",
    "fullDescription": "Elevate your web development journey with the Next.js Redux-Wrapper Material-UI Boilerplate, a robust starting point for crafting dynamic and visually appealing web applications. This meticulously crafted boilerplate combines the power of Next.js, Redux, and Material-UI, streamlining your development process and empowering you to focus on building remarkable user experiences.Whether you're embarking on a new project or seeking to enhance an existing one, the Next.js Redux-Wrapper Material-UI Boilerplate equips you with the essential tools and structure to kickstart your development journey. "
  },
  {
    "title": "Staart",
    "url": "https://github.com/nickredmark/staart",
    "text": "A starter library for node projects with user accounts.",
    "category": "free",
    "hide": "FALSE",
    "page": "staart",
    "fullDescription": "Staart is a powerful tool designed to streamline the initiation of node projects, particularly those requiring user account functionalities. Serving as a starter library, Staart simplifies the process of setting up robust user account systems within node.js applications. With Staart, developers can accelerate their project development by integrating essential user management features seamlessly.Whether you're crafting a web application, API, or any other node.js project requiring user interaction, Staart empowers developers to focus on building unique features without getting bogged down by the complexities of user account management."
  },
  {
    "title": "Next Boilerplate",
    "url": "https://arefaslani.github.io/next-boilerplate/",
    "text": "Simple and easy to use / somewhat opinionated Next boilerplate with redux / redux-saga / dynamic routing / external css / scss and all the cool stuff!",
    "category": "free",
    "hide": "FALSE",
    "page": "next-boilerplate",
    "fullDescription": "Introducing Next Boilerplate, a straightforward and user-friendly toolkit designed to streamline your web development process. This boilerplate is crafted with simplicity and efficiency in mind, offering a balanced blend of essential features and opinionated choices to kickstart your Next.js projects.Built upon the robust Next.js framework, this boilerplate incorporates Redux and Redux-Saga, empowering you with state management capabilities and asynchronous data handling. With dynamic routing capabilities, navigating through your application becomes seamless, ensuring a smooth user experience."
  },
  {
    "title": "NextStarter",
    "url": "https://github.com/YuriBrunetto/next-starter",
    "text": "ð boilerplate for starting projects in next.js",
    "category": "free",
    "hide": "FALSE",
    "page": "nextstarter",
    "fullDescription": "NextStarter is an innovative boilerplate designed to accelerate the initiation of projects built on Next.js, a popular React framework. Developed with a vision to streamline the development process, NextStarter equips developers with a comprehensive set of tools and configurations essential for launching projects swiftly and efficiently.Moreover, NextStarter boasts seamless integration with popular development tools and libraries, facilitating a seamless workflow and enhancing productivity. NextStarter provides the perfect starting point to kickstart your endeavors and propel your ideas to fruition with unparalleled speed and efficiency. ð"
  },
  {
    "title": "Next SMRT",
    "url": "https://github.com/csprance/next-smrt",
    "text": "Next.js / Styled-Components / Material UI / Redux / Typescript Boilerplate (Docker Ready)",
    "category": "free",
    "hide": "FALSE",
    "page": "next-smrt",
    "fullDescription": "Introducing Next SMRT, a comprehensive toolset meticulously crafted for modern web development needs. Next SMRT brings together a powerful combination of cutting-edge technologies to streamline your development process and enhance productivity.Moreover, Next SMRT comes pre-configured with Docker, enabling hassle-free deployment and environment consistency across different platforms. Whether you're a seasoned developer or just starting your journey, Next SMRT empowers you to build exceptional web applications with confidence and efficiency. Say goodbye to boilerplate setup woes and dive straight into crafting remarkable digital experiences with Next SMRT."
  },
  {
    "title": "the NextJS starter",
    "url": "https://github.com/novellito/the-nextjs-starter",
    "text": "Another Next.js boilerplate",
    "category": "free",
    "hide": "FALSE",
    "page": "the-nextjs-starter",
    "fullDescription": "The Next.js Starter is a comprehensive boilerplate designed to jumpstart your Next.js projects with ease and efficiency. Crafted with developers in mind, this starter kit provides a solid foundation for building robust web applications with the Next.js framework.Featuring a clean and organized project structure, The Next.js Starter streamlines the development process by offering pre-configured settings and essential dependencies. With this boilerplate, you can kickstart your projects without the hassle of setting up configurations from scratch, saving you valuable time and effort.Start your Next.js journey on the right foot with The Next.js Starter."
  },
  {
    "title": "NextJS Blog Boilerplate",
    "url": "https://creativedesignsguru.com/demo/Nextjs-Blog-Boilerplate/",
    "text": "Starter code for your Next.js blog Boilerplate with Tailwind CSS",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-blog-boilerplate",
    "fullDescription": "The Next.js Blog Boilerplate is a comprehensive starter kit designed to jumpstart your Next.js blog development journey. Crafted with efficiency and flexibility in mind, this boilerplate provides you with a robust foundation, allowing you to focus more on creating compelling content and less on setting up the technical infrastructure.Featuring seamless integration with Tailwind CSS,a highly customizable utility-first CSS framework, this boilerplate empowers you to effortlessly style your blog to suit your unique aesthetic preferences.Next.js offers server-side rendering,optimized performance, and a streamlined development workflow,enabling you to build fast, SEO-friendly blogs with ease."
  },
  {
    "title": "ð¤ Lobe Chat",
    "url": "https://github.com/lobehub/lobe-chat",
    "text": "Open-sourceâ high-performance chatbot framework that supports speech synthesisâ multimodalâ and extensible Function Call plugin system. Supports one-click free deployment of your private ChatGPT/LLM web application.",
    "category": "free",
    "hide": "FALSE",
    "page": "-lobe-chat",
    "fullDescription": "ð¤ Lobe Chat is an innovative open-source chatbot framework designed for high-performance interactions. Equipped with cutting-edge features, it seamlessly integrates speech synthesis and multimodal capabilities, enabling fluid communication experiences. Lobe Chat boasts an extensible Function Call plugin system, empowering developers to customize and extend its functionalities to suit diverse needs.One of its standout features is the effortless deployment of private ChatGPT/LLM web applications with just a single click. This streamlined deployment process ensures rapid setup and accessibility, making it convenient for users to deploy their personalized chat applications with ease. "
  },
  {
    "title": "SaaS Starter Kit",
    "url": "https://www.saasstarterkit.com/",
    "text": "Saas Starter Kit is a modern and comprehensive SAAS boilerplate that has all the features you would expect in a SAAS and much more. Scroll down to learn more.",
    "category": "free",
    "hide": "FALSE",
    "page": "saas-starter-kit",
    "fullDescription": "SaaS Starter Kit is an innovative and all-encompassing SAAS (Software as a Service) boilerplate designed to streamline the process of building and deploying SaaS applications. This cutting-edge toolkit is meticulously crafted with a plethora of features, ensuring a robust foundation for your next SaaS project and beyond.Featuring an intuitive interface and a rich set of functionalities, SaaS Starter Kit empowers developers and entrepreneurs alike to swiftly kickstart their SaaS ventures without the hassle of starting from scratch. SaaS landscape, this comprehensive toolkit caters to your needs, providing a seamless development experience."
  },
  {
    "title": "SimonHoiberg SaaS Template",
    "url": "https://github.com/SimonHoiberg/saas-template",
    "text": "End-to-end SaaS Template using AWS Amplifyâ Apollo Clientâ Chakraâ and NextJS.",
    "category": "free",
    "hide": "FALSE",
    "page": "simonhoiberg-saas-template",
    "fullDescription": "The SimonHoiberg SaaS Template is a comprehensive solution designed to streamline the development process for Software as a Service (SaaS) applications. Crafted with efficiency and versatility in mind, this template integrates cutting-edge technologies to empower developers in creating robust and scalable SaaS platforms.The SimonHoiberg SaaS Template is a comprehensive solution designed to streamline the development process for Software as a Service (SaaS) applications. Crafted with efficiency and versatility in mind, this template integrates cutting-edge technologies to empower developers in creating robust and scalable SaaS platforms."
  },
  {
    "title": "BoxyHQ Enterprise SaaS Starter Kit",
    "url": "https://github.com/boxyhq/saas-starter-kit",
    "text": "Next.js-based SaaS starter kit saves you months of development by starting you off with all the features that are the same in every productâ so you can focus on what makes your app unique.",
    "category": "free",
    "hide": "FALSE",
    "page": "boxyhq-enterprise-saas-starter-kit",
    "fullDescription": "\"Introducing the BoxyHQ Enterprise SaaS Starter Kit, a comprehensive solution designed to streamline your SaaS development process. Built on the robust Next.js framework, this starter kit empowers you to accelerate your project timeline by bypassing the repetitive groundwork and diving straight into customizing the distinctive aspects of your application.Unleash your creativity and focus on building a SaaS application that truly stands out in the market, while BoxyHQ takes care of the groundwork, saving you valuable time and resources. Get started with the BoxyHQ Enterprise SaaS Starter Kit today and turn your vision into reality with unparalleled efficiency and ease."
  },

  {
    "title": "Ship Apps Fast",
    "url": "https://www.shipappsfast.com/",
    "text": "Launch Your Product in Record Time with NextJS SaaS Boilerplate. Save months of development time setting up Authenticationâ Databaseâ Paymentsâ Landing page and whole lot more.",
    "category": "premium",
    "hide": "FALSE",
    "page": "ship-apps-fast",
    "fullDescription": "\"Introducing the Ship Apps Fast toolkit: the ultimate solution for accelerating your product launch process. Powered by NextJS SaaS Boilerplate, this comprehensive suite of tools is meticulously designed to streamline every aspect of your development journey. Say goodbye to the tedious setup of Authentication, Database integration, Payments processing, Landing page creation, and much more.Stop struggling with the intricacies of backend infrastructure and start shipping your apps with confidence. Embrace the future of rapid product deployment with Ship Apps Fast and witness your ideas come to fruition in record time."
  },

  {
    "title": "Serverless SaaS",
    "url": "https://serverless.page/",
    "text": "Serverless SaaS is a starter kit that serves as the perfect starting point for your SaaS product. Save months of development time and skip implementing authenticationâ paymentsâ teamsâ and more.",
    "category": "premium",
    "hide": "FALSE",
    "page": "serverless-saas",
    "fullDescription": "Serverless SaaS is a comprehensive toolkit designed to accelerate the development of Software as a Service (SaaS) products. Serving as an ideal launchpad for budding entrepreneurs and seasoned developers alike, this starter kit streamlines the creation process by eliminating the need to build fundamental features from scratch. With Serverless SaaS, you can bypass the intricate setup of authentication systems, payment gateways, team management functionalities, and more, saving you invaluable time and effort. Serverless SaaS empowers you to focus on innovation and core functionalities, propelling your SaaS product towards success with efficiency and agility."
  },
  {
    "title": "Hyper SaaS",
    "url": "https://www.hypersaas.dev/",
    "text": "Build your SaaS project in record time ð Whether you're a startup seeking to disrupt markets or a developer looking to enhance your productivityâ HyperSaas has everything you need to hit the ground running.",
    "category": "premium",
    "hide": "FALSE",
    "page": "hyper-saas",
    "fullDescription": "HyperSaaS is the ultimate tool for building your Software as a Service (SaaS) project with unparalleled speed and efficiency. Whether you're a dynamic startup aiming to revolutionize industries or a seasoned developer seeking to boost productivity, HyperSaaS empowers you to hit the ground running with ease.With HyperSaaS, you gain access to a comprehensive suite of features and functionalities tailored to streamline the development process. From robust frameworks to intuitive interfaces, HyperSaaS equips you with all the tools necessary to transform your ideas into fully-functional SaaS solutions."
  },
  {
    "title": "SAAS Starter Kit Pro",
    "url": "https://github.com/Saas-Starter-Kit/SAAS-Starter-Kit-Pro",
    "text": "Saas Starter Kit is a modern SAAS boilerplate. Save weeks of development time having standard SAAS features implemented for youâ and start building your core app right away.",
    "category": "free",
    "hide": "FALSE",
    "page": "saas-starter-kit-pro",
    "fullDescription": "Introducing SAAS Starter Kit Pro, the ultimate solution for kickstarting your Software as a Service (SAAS) projects with ease and efficiency. This cutting-edge tool serves as a modern SAAS boilerplate, designed to streamline your development process and catapult your project into action. With SAAS Starter Kit Pro, you can wave goodbye to countless hours of tedious coding and instead focus on what truly matters â building your core application.With SAAS Starter Kit Pro, you'll save valuable time and resources, enabling you to accelerate your development timeline and stay ahead of the competition. "
  },
  {
    "title": "Nextacular",
    "url": "https://nextacular.co/",
    "text": "An open-source starter kit built with modern full-stack technologies. Worry less and save time developing basic SaaS features",
    "category": "free",
    "hide": "FALSE",
    "page": "nextacular",
    "fullDescription": "Nextacular is an innovative open-source starter kit designed to streamline the development process for SaaS (Software as a Service) applications. Incorporating cutting-edge full-stack technologies, Nextacular empowers developers to embark on projects with confidence, offering a robust foundation for building modern digital solutions. With Nextacular, developers can bid farewell to concerns over time-consuming groundwork, as it provides a comprehensive suite of basic SaaS features.Unlock the potential of Nextacular and elevate your development experience. It's time to accelerate your SaaS journey with confidence."
  },
  {
    "title": "React & Firebase SaaS Starter",
    "url": "https://reactapp.dev/",
    "text": "Reactâ Firebaseâ authenticationâ serverless backendâ Tailwind CSSâ and payments are all hooked up and ready for your next project.",
    "category": "premium",
    "hide": "FALSE",
    "page": "react-firebase-saas-starter",
    "fullDescription": "Introducing the React & Firebase SaaS Starter, your comprehensive solution for launching dynamic web applications with ease. This robust toolkit seamlessly integrates React, Firebase, authentication, serverless backend functionality, Tailwind CSS, and payment processing, providing you with a streamlined foundation for your next project.Tailwind CSS integration empowers you to design visually stunning interfaces with efficiency, utilizing a utility-first approach for rapid styling and customization. Additionally, seamless payment integration enables you to monetize your application effortlessly, whether through subscription models, one-time purchases, or other payment methods."
  },
  {
    "title": "Kickstart App",
    "url": "https://kickstart.app/",
    "text": "Kickstart is the Nextjs boilerplate for building apps fast.",
    "category": "premium",
    "hide": "FALSE",
    "page": "kickstart-app",
    "fullDescription": "Kickstart App is an innovative Next.js boilerplate designed to streamline the app development process, enabling developers to create dynamic and engaging applications swiftly. With its robust set of tools and pre-configured features, Kickstart empowers developers to kick off their projects with ease and efficiency.This comprehensive toolkit provides a solid foundation for building modern web applications, leveraging the power of Next.js to deliver exceptional performance and user experiences.Kickstart simplifies the development workflow, allowing you to focus on crafting unique features and functionalities without getting bogged down by the complexities of setup and configuration."
  },
  {
    "title": "Vercel Blob Next.js Starter",
    "url": "https://blob-starter.vercel.app/",
    "text": "Simple Next.js template that uses Vercel Blob for image uploads",
    "category": "free",
    "hide": "FALSE",
    "page": "vercel-blob-nextjs-starter",
    "fullDescription": "The Vercel Blob Next.js Starter is a straightforward template designed for Next.js applications, leveraging the power of Vercel Blob for seamless image uploads. This starter kit provides developers with a clean and efficient starting point for building web applications with Next.js while incorporating the functionality of Vercel Blob for handling image uploads effortlessly.Overall, the Vercel Blob Next.js Starter offers a convenient and efficient solution for building Next.js applications with seamless image upload functionality, empowering developers to create engaging and dynamic web experiences with ease."
  },
  {
    "title": "Next.js Blog with microCMS",
    "url": "https://simple-blog-with-microcms.vercel.app/",
    "text": "A simple blog built with Next.js and microCMS.",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-blog-with-microcms",
    "fullDescription": "\"Introducing the Next.js Blog with microCMS, a powerful and streamlined solution for creating and managing your own blog effortlessly. This dynamic blogging platform seamlessly combines the flexibility of Next.js, a popular React framework, with the user-friendly content management capabilities of microCMS, offering a smooth and efficient blogging experience.Whether you're a seasoned developer or just starting, the Next.js Blog with microCMS offers a user-friendly and powerful solution to create, manage, and share your content with the world. Elevate your blogging experience with this seamless integration of cutting-edge technologies."
  },

  {
    "title": "LangChain + Next.js Starter",
    "url": "https://langchain-nextjs-template.vercel.app/",
    "text": "Starter template and example use-cases for LangChain projects in Next.js / including chat / agents / and retrieval.",
    "category": "free",
    "hide": "FALSE",
    "page": "langchain-nextjs-starter",
    "fullDescription": "Introducing the LangChain + Next.js Starter: your go-to toolkit for seamlessly integrating LangChain projects into Next.js applications. This starter template provides developers with a comprehensive foundation and example use-cases, empowering them to leverage the powerful capabilities of LangChain within their Next.js projects.The LangChain + Next.js Starter empowers developers to build sophisticated and intelligent applications with ease, combining the flexibility and scalability of Next.js with the advanced language processing capabilities of LangChain.nlock the full potential of natural language processing within your Next.js projects and revolutionize the way users."
  },
  {
    "title": "RAGBot Starter â An Astra DB and OpenAI chatbot",
    "url": "https://ragbot-starter.vercel.app/",
    "text": "Starter project for creating a chatbot using Astra DB and OpenAI.",
    "category": "free",
    "hide": "FALSE",
    "page": "ragbot-starter-an-astra-db-and-openai-chatbot",
    "fullDescription": "RAGBot Starter is a comprehensive toolkit designed for initiating the development of a chatbot utilizing Astra DB and OpenAI technologies. This starter project provides developers with the essential foundation and resources necessary to seamlessly integrate these powerful tools into their chatbot projects.Embark on your journey into the world of conversational AI with RAGBot Starterâa sophisticated fusion of Astra DB and OpenAI, offering an unparalleled foundation for crafting intelligent and engaging chatbots. Revolutionize your applications with the power of natural language understanding and responsive interactions."
  },
  {
    "title": "Salesforce Commerce Cloud Starter",
    "url": "https://salesforce-cloud-commerce.vercel.app/",
    "text": "A coffee ecommerce store built on Next.js and Salesforce Commerce Cloud.",
    "category": "free",
    "hide": "FALSE",
    "page": "salesforce-commerce-cloud-starter",
    "fullDescription": "\"The Salesforce Commerce Cloud Starter is a robust toolkit designed to empower entrepreneurs and businesses to create their own coffee ecommerce store with ease. This innovative solution combines the flexibility and performance of Next.js with the powerful features of Salesforce Commerce Cloud, offering a seamless and efficient platform for online retail.Overall, the Salesforce Commerce Cloud Starter is the ultimate solution for businesses looking to launch a successful coffee ecommerce store quickly and efficiently. With its powerful features, customizable design, and seamless integration, businesses can unlock their full potential in the competitive world of online retail."
  },

  {
    "title": "Next.js Prisma Postgres Auth Starter",
    "url": "https://nextjs-postgres-auth.vercel.app/",
    "text": "Simple Next.js 13 App Router starter kit that uses NextAuth.js for auth / Prisma as the ORM and Vercel Postgres as a database.",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-prisma-postgres-auth-starter",
    "fullDescription": "The Next.js Prisma Postgres Auth Starter is a comprehensive toolkit designed to streamline the development process for web applications. Tailored specifically for Next.js version 13, this starter kit offers a robust foundation for building powerful web applications with minimal setup overhead.The Next.js Prisma Postgres Auth Starter empowers developers to build feature-rich web applications with ease. By combining the power of Next.js, Prisma, PostgreSQL, and NextAuth.js, developers can create scalable, secure, and high-performance applications while reducing development time and complexity."
  },
  {
    "title": "Next.js Contentlayer Blog Starter",
    "url": "https://next-contentlayer.vercel.app/",
    "text": "A blog template with Next.js 13 App Router / Contentlayer / Tailwind CSS and dark mode.",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-contentlayer-blog-starter",
    "fullDescription": "Introducing the Next.js Contentlayer Blog Starter, a dynamic and versatile blog template designed to streamline your content creation process. Developed with the latest technologies, this starter kit combines the power of Next.js 13, App Router, Contentlayer, Tailwind CSS, and a sleek dark mode option.Whether you're a seasoned blogger or just starting your journey, the Next.js Contentlayer Blog Starter empowers you to create captivating content without the hassle. Dive into the world of blogging with confidence, knowing that your platform is equipped with the tools you need to succeed."
  },
  {
    "title": "Next.js Enterprise Boilerplate",
    "url": "https://next-enterprise.vercel.app/",
    "text": "Enterprise-grade Next.js boilerplate built with Tailwind CSS / Radix UI / TypeScript / ESLint / Prettier / Jest / Playwright / Storybook etc.",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-enterprise-boilerplate",
    "fullDescription": "Introducing the Next.js Enterprise Boilerplate â a robust and feature-rich foundation designed for building enterprise-level web applications with unparalleled efficiency and scalability. This meticulously crafted boilerplate leverages the power of cutting-edge technologies, ensuring a seamless development experience for teams aiming for excellence.Whether you are a seasoned developer or leading a development team, the Next.js Enterprise Boilerplate provides a comprehensive foundation, allowing you to focus on building exceptional web applications that meet the demands of the modern enterprise landscape."
  },
  {
    "title": "Next.js App Router Playground",
    "url": "https://app-dir.vercel.app/",
    "text": "Explore the new app directory (App Router) in Next.js 13.",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-app-router-playground",
    "fullDescription": "Welcome to the Next.js App Router Playground! This dynamic platform invites you to delve into the innovative features of Next.js 13, specifically focusing on the cutting-edge App Router functionality. Designed as a comprehensive exploration tool, this playground empowers developers to navigate through the latest advancements in Next.js with ease and precision.Embark on a journey of discovery and innovation with the Next.js App Router Playground. Explore, experiment, and elevate your web development skills to unprecedented levels of proficiency and creativity. The future of Next.js awaits â are you ready to shape it?"
  },
  {
    "title": "Admin Dashboard Template",
    "url": "https://admin-dash-template.vercel.sh/",
    "text": "Tailwind CSS / Postgres and Auth set up.",
    "category": "free",
    "hide": "FALSE",
    "page": "admin-dashboard-template",
    "fullDescription": "The Admin Dashboard Template is a meticulously crafted web development tool designed to streamline the creation of robust administrative interfaces for web applications.With a sleek and modern design aesthetic, this template offers a comprehensive set of features tailored to meet the needs of administrators, developers, and users alike.In summary,the Admin Dashboard Template offers a powerful toolkit for building elegant and functional admin interfaces with ease. With its integration of Tailwind CSS,Postgres,and pre-configured authentication setup,developers can focus on delivering exceptional user experiences while leveraging the latest technologies and best practices in web development."
  },
  {
    "title": "Image Gallery Starter",
    "url": "https://nextjsconf-pics.vercel.app/",
    "text": "An image gallery built on Next.js and Cloudinary.",
    "category": "free",
    "hide": "FALSE",
    "page": "image-gallery-starter",
    "fullDescription": "The Image Gallery Starter is a meticulously crafted tool designed to simplify the creation of stunning image galleries. Leveraging the power of Next.js and Cloudinary, this starter kit provides developers with a robust foundation to swiftly build dynamic and visually captivating galleries for various applications.The Image Gallery Starter empowers developers to customize and extend their galleries with ease, thanks to its modular architecture and well-documented codebase. Whether it's for showcasing portfolios, product catalogs, or multimedia presentations, this tool provides the flexibility and efficiency needed to bring creative visions to life."
  },
  {
    "title": "Next.js Boilerplate",
    "url": "https://nextjs-template.vercel.app/",
    "text": "Get started with Next.js and React in seconds.",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-boilerplate",
    "fullDescription": "The Next.js Boilerplate is a powerful toolkit designed to expedite the process of starting a Next.js and React project, providing developers with a seamless and efficient setup. With this comprehensive starter kit, you can kickstart your web development journey in mere seconds, sparing you the hassle of configuring the basic infrastructure.Whether you're a seasoned developer looking to accelerate your workflow or a newcomer eager to explore the world of Next.js and React, the Next.js Boilerplate is your ultimate companion for building exceptional web applications with unparalleled speed and ease."
  },
  {
    "title": "Precedent âÂ Next.js Starter",
    "url": "https://precedent.vercel.app/",
    "text": "A collection of components / hooks and utilities built on Next.js / Typescript / Tailwind / Radix / Framer Motion / Prisma and PostgreSQL.",
    "category": "free",
    "hide": "FALSE",
    "page": "precedent-nextjs-starter",
    "fullDescription": "Precedent is a comprehensive toolkit designed to streamline web development workflows, specifically tailored for projects utilizing Next.js, TypeScript, Tailwind CSS, Radix UI, Framer Motion, Prisma, and PostgreSQL. It encompasses a curated assortment of components, hooks, and utilities, meticulously crafted to enhance productivity and efficiency in building robust web applications.In summary, Precedent â Next.js Starter is a comprehensive toolkit that empowers developers to build modern, feature-rich web applications with ease, thanks to its extensive collection of components, robust integrations, and focus on productivity and performance."
  },
  {
    "title": "Nextplate",
    "url": "https://github.com/zeon-studio/nextplate",
    "text": "Nextplate is a free starter template built with Next.js and TailwindCSS. It provides you with almost everything you need to jump-start your Next.js project. Try Nextplate and save yourself hours of work.",
    "category": "free",
    "hide": "FALSE",
    "page": "nextplate",
    "fullDescription": "Nextplate is a dynamic and efficient tool designed as a free starter template, meticulously crafted using Next.js and TailwindCSS. Engineered to expedite the initiation of your Next.js projects, Nextplate offers a comprehensive foundation that includes a plethora of essential components and utilities. With Nextplate, you can seamlessly jump-start your development process, significantly reducing the time spent on setting up configurations and layouts. Whether you're a seasoned developer or just starting out, Nextplate empowers you to embark on your projects with confidence and ease, enabling you to focus more on building remarkable web applications and less on tedious setup tasks. "
  },
  {
    "title": "Next.js project",
    "url": "https://github.com/hackclub/theme-starter",
    "text": "ð¤ A sample Next.js project for getting started with MDXâ Theme UIâ & Hack Club Theme.",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-project",
    "fullDescription": "Looking to kickstart your Next.js journey with MDX, Theme UI,and the vibrant aesthetics of the Hack Club Theme?Look no further!Our Next.js Project Starter Kit is precisely crafted to accelerate your development process and unleash your creativity.This starter kit provides you with the essential tools and configurations to seamlessly integrate MDX for Markdown support, Theme UI for consistent theming, and the Hack Club Theme for a visually engaging experience. Join countless developers who have leveraged this starter kit to accelerate their projects and create remarkable digital experiences.Get started today and unlock the full potential of Next.js with MDX,Theme UI, and the Hack Club Theme! ð"
  },
  {
    "title": "NextSSS",
    "url": "https://github.com/ixkaito/nextsss",
    "text": "Next.js static site starter including full setup for TypeScriptâ Tailwind CSSâ Google Analyticsâ Next SEOâ etc.",
    "category": "free",
    "hide": "FALSE",
    "page": "nextsss",
    "fullDescription": "NextSSS is a comprehensive Next.js static site starter kit designed to streamline the process of setting up a robust static website with Next.js. It provides a rich foundation equipped with essential tools and configurations, ensuring a seamless development experience.NextSSS empowers developers to kickstart their static website projects with confidence, offering a comprehensive solution packed with essential tools and configurations. Whether you're building a portfolio, blog, or business website, NextSSS provides a solid foundation for creating high-quality, performant, and SEO-friendly static sites with Next.js."
  },
  {
    "title": "Chakra Nextstarter",
    "url": "https://github.com/sozonome/nextarter-chakra",
    "text": "battery packed template / boilerplate to initialize Next.js app with Chakra UI & Typescript setup â¨",
    "category": "free",
    "hide": "FALSE",
    "page": "chakra-nextstarter",
    "fullDescription": "\"\"\"Chakra Nextstarter\"\" is a powerful toolkit designed to streamline the process of kickstarting Next.js applications with the robust combination of Chakra UI and TypeScript. This battery-packed template serves as a comprehensive boilerplate, equipped with all the essential configurations and dependencies, to facilitate rapid development while adhering to best practices.Featuring a clean and well-organized structure, Chakra Nextstarter promotes code consistency and scalability. So, ignite your Next.js journey with Chakra Nextstarter and embark on a path towards efficient and delightful web development. â¨\""
  },
  {
    "title": "Next.JS with Firebase",
    "url": "https://github.com/bjcarlson42/nextjs-with-firebase",
    "text": "NextJS boiler-plate with Google's Firebase integrated. Watch on YouTube: https://youtu.be/SYnu6CLKD70",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-with-firebase",
    "fullDescription": "Introducing the powerful combination of Next.js with Firebase - a dynamic duo for building modern web applications with ease and efficiency. This Next.js boilerplate comes pre-configured with Google's Firebase, seamlessly integrating robust backend services with Next.js' exceptional frontend capabilities.This boilerplate eliminates the hassle of setting up and configuring Firebase from scratch, allowing you to dive straight into building your application. Whether you're creating a simple landing page or a complex web app, this integration empowers you to focus on crafting exceptional user experiences while Firebase handles the heavy lifting behind the scenes."
  },
  {
    "title": "Modern React Portfolio Template",
    "url": "https://github.com/chetanverma16/react-portfolio-template",
    "text": "Modern React Portfolio Template (FREE)",
    "category": "free",
    "hide": "FALSE",
    "page": "modern-react-portfolio-template",
    "fullDescription": "The Modern React Portfolio Template is a cutting-edge, sleek, and professional website template crafted specifically for showcasing portfolios, projects, and personal achievements. Built using the latest technologies and leveraging the power of React, this template offers a seamless and dynamic user experience.Experience the versatility and sophistication of the Modern React Portfolio Template today, and take the first step towards showcasing your talents and achievements in style. Download the template for free and unleash the full potential of your portfolio with modern technologies and design aesthetics."
  },
  {
    "title": "Next.js for Firebase Auth",
    "url": "https://github.com/shreyas-jadhav/next-firebase-starter",
    "text": "Next.js starter code for Implementing Firebase Auth + Firestore + Cloud Messaging",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-for-firebase-auth",
    "fullDescription": "Unlock the power of seamless authentication and real-time data management with our Next.js starter code tailored for Firebase integration. Harnessing the capabilities of Next.js alongside Firebase Authentication, Firestore, and Cloud Messaging, our toolkit empowers developers to craft robust web applications with minimal hassle.Leveraging Firebase Firestore, our toolkit enables real-time data synchronization, allowing for dynamic content updates without page reloads. Store and retrieve user data, manage complex data structures, and implement powerful querying capabilities to enhance your application's functionality."
  },
  {
    "title": "NextPostgres",
    "url": "https://github.com/jimmylee/next-postgres",
    "text": "[OUTDATED] A minimal example web application using NextJS 12.0.7â Postgres 11â Google OAuth2 and other useful libraries.",
    "category": "free",
    "hide": "FALSE",
    "page": "nextpostgres",
    "fullDescription": "NextPostgres is a now outdated but historically significant web application framework that exemplifies the integration of cutting-edge technologies. Developed using Next.js 12.0.7 and leveraging the power of Postgres 11, NextPostgres serves as a robust foundation for building web applications with efficiency and scalability in mind.While no longer actively maintained, NextPostgres remains a valuable resource for developers seeking insights into building web applications with Next.js, Postgres, and OAuth2 authentication. Its minimalist design and intuitive architecture serve as a blueprint for crafting modern, data-driven web experiences."
  },
  {
    "title": "This project is an example of React + Next.js + Postgres",
    "url": "https://github.com/mihalskiy/next-postgres",
    "text": "This project is an example of React + NextJS + Postgres. It is tailored for those who are enthusiastic about building websites with 100% JavaScript.  ",
    "category": "free",
    "hide": "FALSE",
    "page": "this-project-is-an-example-of-react-nextjs-postgres",
    "fullDescription": "Embark on your journey of building dynamic websites with the ultimate toolkit: React, Next.js, and Postgres. This project exemplifies the seamless integration of these cutting-edge technologies, providing a robust foundation for creating modern web applications.React, renowned for its declarative and component-based architecture, serves as the cornerstone for front-end development. With its efficient rendering and state management capabilities, React empowers developers to craft interactive user interfaces with ease.Tailored for JavaScript enthusiasts, this project provides a comprehensive example of leveraging React, Next.js, and Postgres to build feature-rich websites."
  },
  {
    "title": "Next.js eCommerce template",
    "url": "https://crystallize.com/learn/open-source/boilerplates/react-nextjs",
    "text": "The boilerplate was developed with performanceâ a good developer experienceâ and best practices in mind.",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-ecommerce-template",
    "fullDescription": "Introducing the Next.js eCommerce template, a meticulously crafted boilerplate designed with a focus on performance, exceptional developer experience, and adherence to industry best practices. This comprehensive toolkit empowers developers to swiftly create cutting-edge eCommerce applications with unparalleled efficiency and precision.Whether you're a seasoned developer looking to accelerate project delivery or a newcomer seeking a solid foundation for your eCommerce aspirations, the Next.js eCommerce template is your gateway to building high-performance, feature-rich online stores that stand out in today's competitive digital landscape."
  },
  {
    "title": "Starter Project",
    "url": "https://github.com/adamlove01/nextjs-materialui-mysql-starter",
    "text": "Nextjs 9 + Material UI + mySQL Starter",
    "category": "free",
    "hide": "FALSE",
    "page": "starter-project",
    "fullDescription": "The Starter Project combines cutting-edge technologies to provide developers with a robust foundation for web application development. Leveraging Next.js 9, Material UI, and MySQL, this starter kit streamlines the process of building dynamic and visually appealing web applications with powerful backend support.Whether you're building a prototype, a scalable web application, or anything in between, the Starter Project provides a solid foundation equipped with modern technologies and best practices, empowering developers to bring their ideas to life with speed, reliability, and elegance."
  },
  {
    "title": "Email login system starter",
    "url": "https://github.com/tejisav/nextjs-express-mysql-starter",
    "text": "A simple email login system starter built using Next.jsâ Reactstrapâ Node.js Express and MySQL",
    "category": "free",
    "hide": "FALSE",
    "page": "email-login-system-starter",
    "fullDescription": "The Email Login System Starter is a comprehensive toolkit designed to facilitate the creation of a robust authentication system for web applications. Crafted with efficiency and simplicity in mind, this starter kit leverages cutting-edge technologies including Next.js, Reactstrap, Node.js Express, and MySQL to offer a seamless user experience.Whether you're launching a new project or enhancing an existing application, the Email Login System Starter provides a solid foundation for implementing a secure and reliable authentication system. Empower your users with seamless access while maintaining the highest standards of security and performance."
  },
  {
    "title": "Next.JS CRUD using MySQL",
    "url": "https://github.com/FaztWeb/nextjs-mysql-crud",
    "text": "Nextjs CRUD using MySQL and TailwindCSS",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-crud-using-mysql",
    "fullDescription": "Embark on a journey of efficient web development with Next.js, MySQL, and Tailwind CSS, crafting a robust CRUD (Create, Read, Update, Delete) application. This powerful combination of technologies empowers developers to create dynamic, responsive, and visually appealing web applications with ease.This comprehensive toolkit empowers developers to create feature-rich CRUD applications, seamlessly integrating front-end and back-end functionalities. Tailwind CSS, a utility-first CSS framework, simplifies the process of styling your Next.js application.Tailwind CSS enables developers to rapidly prototype and customize the appearance of their web applications."
  },
  {
    "title": "NextJS Starter",
    "url": "https://github.com/pbteja1998/nextjs-starter",
    "text": "A starter project for next js with authentication - Contains React 17 + Typescript + Tailwind CSS 2 + React Query 3 + GitHub Auth + LinkedIn Auth + Password-less Auth + Fauna DB + ESLint + Prettier + Husky",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-starter",
    "fullDescription": "Introducing NextJS Starter, a meticulously crafted starter project designed to kickstart your Next.js applications with seamless authentication integration. Developed to streamline your development process, this comprehensive toolkit combines cutting-edge technologies to empower your projects with robust functionality and enhanced security measures.Whether you're building a personal project, a startup MVP, or a production-grade application, NextJS Starter provides the essential tools and integrations to accelerate your development process and deliver high-quality Next.js applications with confidence."
  },
  {
    "title": "Next.JS and MongoDB",
    "url": "https://github.com/tejasrana95/nextjs-mongo-crud",
    "text": "A full-fledged app made with Next.JS and MongoDB.",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-and-mongodb",
    "fullDescription": "Next.js, a popular React framework, offers server-side rendering, automatic code splitting, and simplified routing, allowing developers to build fast and scalable web applications with ease. Its intuitive API and extensive plugin ecosystem make it an ideal choice for building modern web applications.MongoDB, on the other hand, is a flexible and scalable NoSQL database that stores data in a JSON-like format, making it perfect for handling unstructured or semi-structured data. Its document-based model allows for easy scalability and high performance, making it an excellent choice for applications with rapidly evolving data requirements."
  },
  {
    "title": "Landing Page theme",
    "url": "https://github.com/ixartz/Next-JS-Landing-Page-Starter-Template",
    "text": "ð Free NextJS Landing Page Template written in Tailwind CSS 3 and TypeScript â¡ï¸ ",
    "category": "free",
    "hide": "FALSE",
    "page": "landing-page-theme",
    "fullDescription": "Introducing the dynamic and versatile Landing Page theme, a powerful tool designed to elevate your web presence with ease. Crafted with precision, this theme seamlessly integrates the robust capabilities of NextJS, Tailwind CSS 3, and TypeScript, offering you a cutting-edge solution for creating captivating landing pages that captivate your audience from the moment they arrive.Whether you're launching a new product, promoting a service, or capturing leads, the Landing Page theme provides the perfect canvas to showcase your offerings and drive conversions. Elevate your online presence and make a lasting impression with this powerful, feature-rich template."
  },
  {
    "title": "Boilerplate and Starter",
    "url": "https://www.libhunt.com/r/Next-js-Boilerplate",
    "text": "Boilerplate and Starter for Next.js 14+ with App Router and Page Router supportâ Tailwind CSS 3.3 and TypeScript",
    "category": "free",
    "hide": "FALSE",
    "page": "boilerplate-and-starter",
    "fullDescription": "Introducing the ultimate toolkit for streamlined web development: the Boilerplate and Starter for Next.js 14+. Designed to empower developers with efficiency and flexibility, this comprehensive package seamlessly integrates cutting-edge technologies to jumpstart your projects with ease.Furthermore, this toolkit embraces Tailwind CSS 3.3, the utility-first CSS framework loved by developers for its simplicity and adaptability. In summary, the Boilerplate and Starter for Next.js 14+ with App Router and Page Router support, Tailwind CSS 3.3, and TypeScript redefines the paradigm of modern web development."
  },
  {
    "title": "Next.js eCommerce template",
    "url": "https://github.com/olafsulich/fullstack-nextjs-ecommerce",
    "text": "Fullstack Next.js E-Commerce made with NextAuth + Prisma and much more ð",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjs-ecommerce-template",
    "fullDescription": "Introducing the Next.js eCommerce Template, a comprehensive solution for crafting robust and dynamic online stores. This full-stack Next.js eCommerce template is meticulously designed, integrating cutting-edge technologies such as NextAuth and Prisma to empower seamless user experiences and efficient management of your online business.With a focus on scalability and performance, this template offers a feature-rich environment for both developers and entrepreneurs. Whether you're launching a startup or expanding an existing enterprise, this template provides a solid foundation to build upon. Embark on your eCommerce journey with confidence, equipped with the Next.js eCommerce Template."
  },
  {
    "title": "Next E-Commerce",
    "url": "https://github.com/anilsenay/next-e-commerce",
    "text": "An e-commerce website example with NextJS that I made in 1 week as a self challenge. Using Firebase as backend.",
    "category": "free",
    "hide": "FALSE",
    "page": "next-ecommerce",
    "fullDescription": "\"\"\"Next E-Commerce\"\" is a dynamic e-commerce platform crafted within the span of just one week, embodying the innovative capabilities of NextJS framework. Developed as a personal challenge, this website stands as a testament to the rapid development potential offered by modern web technologies.With a sleek and intuitive user interface, Next E-Commerce facilitates effortless browsing and shopping experiences for customers, while also offering comprehensive admin functionalities for easy product management and order tracking.Next E-Commerce streamlines the e-commerce journey, delivering a feature-rich solution tailored to modern demands.\""
  },
  {
    "title": "Next-Shopify Starter",
    "url": "https://github.com/btahir/next-shopify-starter",
    "text": "Nextjs + Tailwind CSS + Shopify Starter",
    "category": "free",
    "hide": "FALSE",
    "page": "nextshopify-starter",
    "fullDescription": "The Next-Shopify Starter is a powerful toolkit designed to streamline the development process for e-commerce websites, specifically those built on the Shopify platform. This comprehensive starter kit combines the robust features of Next.js, the flexibility of Tailwind CSS, and the seamless integration capabilities of Shopify, offering developers a solid foundation to create stunning, high-performance online stores.With the Next-Shopify Starter, developers can accelerate the development cycle, focus on creating engaging user interfaces, and deliver feature-rich online stores that meet the demands of modern e-commerce."
  },
  {
    "title": "Next-ecommerce",
    "url": "https://github.com/lucaspulliese/next-ecommerce",
    "text": "A beautiful ecommerce made with Next.js",
    "category": "free",
    "hide": "FALSE",
    "page": "nextecommerce",
    "fullDescription": "Next-ecommerce is an elegantly crafted ecommerce platform built with Next.js, a cutting-edge framework renowned for its performance and versatility. Seamlessly blending aesthetics with functionality, Next-ecommerce offers a captivating user experience designed to elevate online shopping to new heights.Driven by a commitment to excellence, Next-ecommerce provides a comprehensive suite of tools and features tailored to streamline the entire ecommerce process. From customizable storefronts to secure payment gateways, merchants can effortlessly manage inventory, fulfill orders, and engage with customers, all within a unified and intuitive dashboard."
  },
  {
    "title": "E-Commerce Starter NextJS",
    "url": "https://github.com/RafaelGoulartB/next-ecommerce",
    "text": "â¡ Quantum Ecommerce. Made with Next.js | GraphQL | Apollo Server | Apollo Client | SSR",
    "category": "free",
    "hide": "FALSE",
    "page": "ecommerce-starter-nextjs",
    "fullDescription": "The E-Commerce Starter NextJS is a cutting-edge toolkit designed to kickstart your online retail journey into the realm of quantum speed and efficiency. Crafted with Next.js, a leading-edge React framework, this solution promises lightning-fast performance and seamless user experiences.With server-side rendering (SSR) capabilities, your e-commerce site will boast lightning-fast page loads, enhancing user engagement and satisfaction. Incorporating modern technologies and best practices, the E-Commerce Starter NextJS is your gateway to unlocking the full potential of quantum e-commerce."
  },
  {
    "title": "Commerce",
    "url": "https://github.com/vercel/commerce",
    "text": "Next.js Commerce",
    "category": "free",
    "hide": "FALSE",
    "page": "commerce",
    "fullDescription": "Next.js Commerce is an advanced toolkit designed to streamline and enhance the development of e-commerce websites. Built on top of the Next.js framework, Next.js Commerce offers a comprehensive suite of tools and features tailored specifically for online retail businesses. It combines the flexibility and performance of Next.js with powerful e-commerce functionalities to provide developers with a seamless and efficient development experience.Whether launching a new online store or optimizing an existing one, Next.js Commerce provides the tools and resources needed to succeed in the competitive world of e-commerce."
  },
  {
    "title": "Pankod",
    "url": "https://pankod.github.io/next-boilerplate/",
    "text": "Performance oriented Next.js application boilerplate with Reduxâ Typescriptâ Express.jsâ Sass and Project CLI.",
    "category": "free",
    "hide": "FALSE",
    "page": "pankod",
    "fullDescription": "Pankod is an advanced and meticulously crafted toolkit designed to accelerate the development of high-performance Next.js applications. Developed with a keen focus on performance, it serves as a comprehensive boilerplate that seamlessly integrates essential technologies such as Redux, Typescript, Express.js, and Sass.Pankod also features a convenient Project CLI (Command Line Interface), enabling developers to scaffold new projects, manage dependencies, and streamline common tasks with ease. With its comprehensive toolset and performance-oriented design, Pankod is the ideal choice for developers seeking to build cutting-edge Next.js applications efficiently and effectively."
  },
  {
    "title": "Nextjs-boilerplate",
    "url": "https://github.com/NikSchaefer/nextjs-boilerplate",
    "text": "âï¸ NextJS Boilerplate with TailwindCSSâ Typescriptâ Prettierâ and Google Analytics. For CI/CD with Vercel",
    "category": "free",
    "hide": "FALSE",
    "page": "nextjsboilerplate",
    "fullDescription": "The Next.js Boilerplate is a comprehensive starting point for web development projects built on the Next.js framework. Integrating powerful tools and technologies, this boilerplate streamlines the development process, ensuring efficiency and scalability. Whether you're building a simple website, a complex web application, or anything in between, the Next.js Boilerplate equips you with the essential tools and best practices to accelerate your development process while ensuring scalability, maintainability, and performance. Start your project on a solid foundation and bring your ideas to life with confidence."
  },
  {
    "title": "NextBP",
    "url": "https://github.com/Devkant21/Next-BP",
    "text": "A boilerplate website available for the user customization",
    "category": "free",
    "hide": "FALSE",
    "page": "nextbp",
    "fullDescription": "NextBP is an innovative tool designed to streamline website development processes with ease and efficiency. Functioning as a boilerplate website, NextBP offers a solid foundation for users to kickstart their online presence swiftly. What sets NextBP apart is its adaptability and flexibility, allowing users to seamlessly customize every aspect of their website according to their unique preferences and requirements.Featuring a diverse range of templates, layouts, and design elements, NextBP caters to various industries and purposes, from personal blogs to e-commerce ventures. Users can easily modify colors, fonts, images, and content to align with their brand identity or personal style."
  },
  {
    "title": "Songlist",
    "url": "https://songlist.dev/",
    "text": "NextJS Boilerplate",
    "category": "free",
    "hide": "FALSE",
    "page": "songlist",
    "fullDescription": "Songlist is a versatile digital tool designed to manage and organize music collections efficiently. With its intuitive interface and comprehensive features, Songlist streamlines the process of cataloging, sorting, and accessing your favorite tunes.NextJS Boilerplate is a powerful starting point for building modern web applications using Next.js, a popular React framework. With NextJS Boilerplate, kickstart your web development projects with confidence, knowing that you have a solid foundation built on industry best practices and cutting-edge technologies.NextJS Boilerplate empowers you to deliver exceptional results efficiently and effectively."
  },
  {
    "title": "Sanity",
    "url": "https://github.com/jakub-siwiec/sanity-nextjs-js-boilerplate",
    "text": "This boilerplate facilitates using monorepo with dependencies from both Next.js 12 and Sanity.io for the development stage.",
    "category": "free",
    "hide": "FALSE",
    "page": "sanity",
    "fullDescription": "Sanity is a comprehensive boilerplate solution designed to streamline the development process for projects utilizing a monorepo structure with dependencies from Next.js 12 and Sanity.io frameworks.This boilerplate provides a robust foundation for developers to efficiently manage and organize their codebase within a monorepo setup, allowing for the simultaneous development of Next.js and Sanity.io components. It includes essential configurations and dependencies to ensure compatibility and smooth interoperability between these frameworks.Whether building dynamic web applications or content-rich websites, Sanity empowers developers to create exceptional digital experiences with ease."
  },
  {
    "title": "NestaJS",
    "url": "https://nestajs.com/",
    "text": "Nesta.js is the perfect starting point for your next big idea. Focus on what matters: your application.",
    "category": "premium",
    "hide": "FALSE",
    "page": "nestajs",
    "fullDescription": "Nesta.js is a powerful tool designed to be the ideal launchpad for your next innovative project. With Nesta.js, you can dive straight into building your application without getting bogged down by unnecessary complexities. It empowers developers to concentrate their efforts on what truly matters: crafting exceptional user experiences and bringing their creative visions to life.Nesta.js is a powerful tool designed to be the ideal launchpad for your next innovative project.Nesta.js empowers you to unleash your creativity and turn your ideas into reality. Say goodbye to unnecessary complexities and hello to a streamlined development experience with Nesta.js."
  },
  {
    "title": "Suparepos",
    "url": "https://www.suparepos.dev/",
    "text": "Sell access to your GitHub repositories in 5 minutes",
    "category": "free",
    "hide": "FALSE",
    "page": "suparepos",
    "fullDescription": "Suparepos is a revolutionary tool designed to streamline the process of selling access to your GitHub repositories, offering a seamless solution in just five minutes. With its user-friendly interface and intuitive features, Suparepos empowers developers and creators to monetize their hard work effortlessly.Whether you're an individual developer, a startup, or a seasoned enterprise, Suparepos caters to your needs by simplifying the access-selling process. It eliminates the complexities traditionally associated with setting up payment gateways, managing subscriptions, and controlling access permissions, allowing you to focus on what you do best â developing innovative solutions."
  },
  {
    "title": "NotionFlow",
    "url": "https://www.notionflow.site/",
    "text": "NextJS boilerplate with Notion as CMS",
    "category": "free",
    "hide": "FALSE",
    "page": "notionflow",
    "fullDescription": "NotionFlow is a powerful Next.js boilerplate meticulously designed to seamlessly integrate Notion as a Content Management System (CMS). With NotionFlow, developers can effortlessly create dynamic and data-driven websites leveraging the robust capabilities of Next.js and the versatility of Notion.NotionFlow is a powerful Next.js boilerplate meticulously designed to seamlessly integrate Notion as a Content Management System (CMS). With NotionFlow, developers can effortlessly create dynamic and data-driven websites leveraging the robust capabilities of Next.js and the versatility of Notion."
  },
  {
    "title": "supaboost",
    "url": "https://www.supaboost.dev/",
    "text": "The All-in-One Supabase and NextJS SaaS starter template",
    "category": "premium",
    "hide": "FALSE",
    "page": "supaboost",
    "fullDescription": "Introducing Supaboost: the ultimate solution for developers seeking to streamline their Supabase and Next.js projects. Supaboost serves as an all-in-one SaaS starter template, designed to accelerate the development process and enhance productivity.Supaboost comes packed with essential features and tools, carefully crafted to kickstart your project and minimize setup time. From user authentication and authorization to database management and API integrations, Supaboost handles it all, allowing you to focus on building your application's unique features and functionalities.Say goodbye to tedious setup processes and hello to rapid development with Supaboost."
  },
  {
    "title": "CreateNextStartup",
    "url": "https://createnextstartup.com/",
    "text": "Rapidly launch your next idea with less effort  ",
    "category": "premium",
    "hide": "FALSE",
    "page": "createnextstartup",
    "fullDescription": "CreateNextStartup is a dynamic tool designed to expedite the process of launching your next big idea with minimal effort. Whether you're an entrepreneur, innovator, or simply someone with a vision, this tool equips you with the necessary resources to bring your concept to life swiftly and efficiently. With CreateNextStartup, you can streamline every aspect of the startup process, from conceptualization to execution, enabling you to focus more on the creative aspect of your project and less on the logistics. Harness the power of CreateNextStartup to transform your ideas into tangible realities in record time, and embark on your entrepreneurial journey with confidence and ease."
  },
  {
    "title": "Cult",
    "url": "https://www.newcult.co/",
    "text": "The only SaaS toolkit that comes with an AI Co-founder.",
    "category": "free",
    "hide": "FALSE",
    "page": "cult",
    "fullDescription": "Introducing Cult,the revolutionary SaaS toolkit that redefines entrepreneurship by incorporating an AI Co-founder into its framework. Cult offers an innovative solution for startups and businesses seeking to enhance their strategic decision-making processes and streamline their operations.With Cult, entrepreneurs gain access to a comprehensive suite of tools designed to empower their ventures,all while leveraging the unparalleled capabilities of artificial intelligence.Cult is the ultimate solution for harnessing the power of AI in business management. Join the revolution today and unlock the full potential of your venture with Cultâthe SaaS toolkit with an AI Co-founder by your side."
  },
  {
    "title": "The Dev Starter",
    "url": "https://thedevstarter.com/",
    "text": "Next.js and Django SaaS Boilerplate: A Perfect Match for Enterprises",
    "category": "premium",
    "hide": "FALSE",
    "page": "the-dev-starter",
    "fullDescription": "\"The Dev Starter is a comprehensive toolkit designed to streamline the development process for enterprises, offering a seamless integration of Next.js and Django frameworks. This SaaS (Software as a Service) Boilerplate is meticulously crafted to meet the demanding needs of modern businesses, providing a powerful foundation for building robust web applications.In summary, \"\"The Dev Starter\"\" is the ultimate solution for enterprises seeking to kickstart their web development projects with Next.js and Django. By combining the power of these two frameworks, it offers a perfect match for building cutting-edge SaaS applications that meet the demands of today's digital landscape.\""
  }
]
